import type { Metadata } from "next";
import Image from "next/image";
import Link from "next/link";

import Heading from "@/components/general_pages/heading";
import ProductParagraph from "@/components/catalog/productParagraph";
import CategoryCards from "@/components/categoryCards";
import LinkButtonsBlock from "@/components/linkButtonsBlock";
import SaturatedSteamPropertiesTable from "@/components/general_pages/saturatedSteamPropertiesTable";
import { NumberedAnchor } from "@/components/utils/anchor/numbered";
import WaterPropsOnSaturationLineTable from "@/components/general_pages/waterPropsOnSaturationLineTable";

export const metadata: Metadata = {
  title: "Водяные калориферы и свойства воды как теплоносителя",
  description:
    "Водяные промышленные калориферы. Работа в системах вентиляции, правила эксплуатации на производстве, процессы нагрева и остывания воды в воздухонагревателе",
  keywords:
    "водяной калорифер,воздухонагреватель водяной,водяные промышленные калориферы,свойства воды как теплоносителя,остывание воды в калорифере,принцип работы водяного калорифера,правила эксплуатации водяных калориферов,давление и температура в водяном калорифере,производство водяных калориферов,модели биметаллических водяных калориферов",
};

export default function KaloriferParPage() {
  return (
    <>
      <Heading lvl={1} text="Водяной калорифер" />

      <ProductParagraph>
        Конструктивные особенности, теплофизические свойства и возможности
        использования промышленных водовоздушных нагревателей. В разделах
        детально описаны основы функционирования многоходового гидравлического
        тракта, механизм непрерывного остывания жидкого теплоносителя и
        специфика температурного распределения по рабочей поверхности.
        Представлена таблица зависимости основных параметров воды от температуры
        на линии насыщения, а также рассмотрены ключевые факторы сохранения
        эксплуатационного ресурса и требования к качеству водоподготовки. В
        завершении приведена номенклатура базовых серий выпускаемых заводом
        калориферов для комплектации систем вентиляции, воздушного отопления и
        сушильных камер.
      </ProductParagraph>

      <LinkButtonsBlock
        buttons={[
          {
            name: "Водяные воздухоподогреватели",
            url: "/kalorifer-voda#anchor2",
            hiddenText:
              "Водяные оребренные воздухонагреватели для систем вентиляции",
          },
          {
            name: "Таблица свойств воды",
            url: "/kalorifer-voda#anchor1",
            hiddenText:
              "Таблица свойств воды на линии насыщения для калориферов",
          },
        ]}
      />

      {/* Принцип работы водяного калорифера */}
      <section className="space-y-6">
        <Heading lvl={2} text="Принцип работы водяного калорифера" />

        <ProductParagraph>
          Высокая удельная теплоемкость определяет целесообразность
          использования горячей или перегретой воды в качестве стабильного и
          экономичного теплоносителя в системах вентиляции. Принцип работы
          водяного калорифера построен на конвективной передаче теплоты жидкой
          среды нагреваемому воздуху. Горячая вода под давлением циркулирует
          внутри трубок, передавая тепловую энергию их металлическим стенкам и
          развитому алюминиевому оребрению, которые снаружи омываются поперечным
          воздушным потоком. К особенностям эксплуатации промышленных
          воздухонагревателей данного типа относится необходимость поддержания
          расчетного скоростного режима в каналах, что не только повышает общую
          эффективность теплосъема, но и исключает риск замерзания прибора в
          зимний период из-за критического замедления протока жидкости.
        </ProductParagraph>

        <div className="bg-primary-dark/50 mx-auto h-1 w-2/3 rounded-full mask-[linear-gradient(to_right,transparent,black,transparent)]" />

        {/* Теплоноситель – вода */}
        <section className="text-[#5a769a]">
          <Heading lvl={3} text="Теплоноситель – вода" />
          <ProductParagraph className="text-base">
            Вода является наиболее распространенным и доступным теплоносителем в
            промышленных системах вентиляции и воздушного отопления. При
            нормальном атмосферном давлении она сохраняет стабильную жидкую фазу
            в диапазоне от 0 до 100 °C, а в замкнутых контурах под давлением —
            вплоть до 150 °C и выше. Энергия, которую необходимо затратить на
            повышение температуры одного килограмма воды на один градус Цельсия,
            определяет ее удельную теплоемкость, которая является одной из самых
            высоких относительно других жидких текучих сред.
          </ProductParagraph>
        </section>

        <div className="flex w-full flex-col gap-3 sm:flex-row sm:gap-0">
          <div className="relative aspect-1000/650 w-full">
            <Image
              src="/img/general_pages/kalorifer_voda_2_3.png"
              alt="Устройство водяного калорифера"
              title="Водяной калорифер двухрядный и трехрядный"
              fill
            />
          </div>
          <div className="relative aspect-1000/650 w-full">
            <Image
              src="/img/general_pages/kalorifer_voda_4.png"
              alt="Конструкция водовоздушного калорифера"
              title="Водяной калорифер четырехрядный"
              fill
            />
          </div>
        </div>
      </section>

      <div className="bg-primary-dark/50 mx-auto h-1 w-2/3 rounded-full mask-[linear-gradient(to_right,transparent,black,transparent)]" />

      {/* Устройство водяного калорифера */}
      <section className="space-y-6">
        <Heading lvl={2} text="Устройство водяного калорифера" />

        <ProductParagraph>
          Конструктивно водяной калорифер представляет собой монолитный блок с
          автономным гидравлическим трактом, включающим элементы подвода,
          распределения и вывода теплоносителя. Нагревательные элементы
          выполнены из стальных цилиндрических трубок с накатными алюминиевыми
          ребрами. Своими концами трубки вварены в трубные решетки, поверх
          которых монтируются распределительно-сборные многоходовые коллекторы с
          внутренними перегородками, задающими направление движения потока.
          Сегментирование коллекторов также обеспечивает высокую скорость
          циркуляции воды и существенно повышает эффективность теплопередачи. В
          корпуса распределительных крышек вварены входной и выходной патрубки,
          через которые калорифер жестко или посредством фланцев интегрируется в
          подающую и обратную линии гидравлической сети.
        </ProductParagraph>

        <ProductParagraph>
          Для монтажа прибора в состав вентиляционных камер к торцам трубных
          решеток крепятся съемные боковые щитки, образующие защитный кожух
          воздухонагревателя. При компоновке калориферов в многорядные
          теплообменные секции эти монтажные боковины демонтируются, что
          позволяет соединять модули и формировать сплошной тепловой фронт без
          проскока холодных воздушных масс.
        </ProductParagraph>

        <LinkButtonsBlock
          buttons={[
            {
              url: "/raschet-podbor-kaloriferov",
              name: "Расчет водяного калорифера",
              hiddenText: "Методика расчета и подбора водяных калориферов",
            },
            {
              url: "/kalorifery-voda#anchor1",
              name: "Калькулятор подбора",
              hiddenText:
                "Программа подбора водяных приточных воздухонагревателей",
            },
          ]}
        />

        <div className="bg-primary-dark/50 mx-auto h-1 w-2/3 rounded-full mask-[linear-gradient(to_right,transparent,black,transparent)]" />

        {/* Процесс нагрева и аккумулирования тепла */}
        <section className="text-[#5a769a]">
          <Heading lvl={3} text="Процесс нагрева и аккумулирования тепла" />
          <ProductParagraph className="text-base">
            В отличие от пара, вода передает тепловую мощность воздушному потоку
            без изменения своего агрегатного состояния, исключительно за счет
            падения температуры при остывании. Количество теплоты,
            аккумулированное в жидкости, напрямую зависит от текущего
            температурного уровня и массы. Приращение теплосодержания происходит
            пропорционально по мере подвода мощности в водогрейном котле или
            сетевом теплообменном пункте. Вся затраченная на подготовку системы
            энергия транспортируется к калориферу непосредственно внутри
            водяного подающего контура.
          </ProductParagraph>
        </section>
      </section>

      <div className="bg-primary-dark/50 mx-auto h-1 w-2/3 rounded-full mask-[linear-gradient(to_right,transparent,black,transparent)]" />

      {/* Поверхность нагрева водяного калорифера */}
      <section className="space-y-6">
        <Heading lvl={2} text="Поверхность нагрева водяного калорифера" />

        <ProductParagraph>
          Увеличение площади внешней поверхности теплообмена биметаллического
          воздухонагревателя обеспечивается за счет круглых ребер, формируемых
          методом поперечно-винтовой накатки алюминия на несущие стальные
          трубки. Холодная прокатка под высоким давлением гарантирует монолитный
          контакт между разнородными металлами, высокую прочность оребрения и
          надежную защиту базовых трубок от атмосферной коррозии. Внутри корпуса
          калорифера теплопередающие элементы компонуются в шахматном порядке в
          два, три или четыре ряда перпендикулярно набегающему воздушному
          потоку. Подобная геометрия пучка в сочетании с выверенным шагом
          оребрения создает оптимальную турбулизацию проходящего воздуха и
          максимизирует коэффициент теплоотдачи прибора при относительно
          невысоком аэродинамическом сопротивлении.
        </ProductParagraph>

        <LinkButtonsBlock
          buttons={[
            {
              name: "Расчет расхода воды",
              url: "/raschet-podbor-kaloriferov#anchor4",
              hiddenText: "Расчет массового расхода теплоносителя калорифером",
            },
            {
              name: "Скорость теплоносителя",
              url: "/raschet-podbor-kaloriferov#anchor5",
              hiddenText: "Оптимальная скорость воды в трубках калорифера",
            },
          ]}
        />

        <div className="bg-primary-dark/50 mx-auto h-1 w-2/3 rounded-full mask-[linear-gradient(to_right,transparent,black,transparent)]" />

        {/* Удельная энтальпия воды */}
        <section className="text-[#5a769a]">
          <Heading lvl={3} text="Удельная энтальпия воды" />

          <ProductParagraph className="text-base">
            Аккумулированная в подающем контуре энергия одного килограмма
            жидкости определяет ее полное теплосодержание, называемое в
            термодинамике удельной энтальпией. Разница между значениями этой
            величины на входе в биметаллический воздухонагреватель и на выходе
            из него определяет чистый потенциал, который рабочая среда способна
            передать воздушному потоку, и задает конечную эффективность всей
            приточной установки.
          </ProductParagraph>
        </section>
      </section>

      <div className="bg-primary-dark/50 mx-auto h-1 w-2/3 rounded-full mask-[linear-gradient(to_right,transparent,black,transparent)]" />

      {/* Теплопередача водяного калорифера */}
      <section className="space-y-6">
        <Heading lvl={2} text="Теплопередача водяного калорифера" />

        <ProductParagraph>
          Транспортируемая по теплоцентрали сетевая вода несет в себе высокий
          потенциал внутренней энергии. При поступлении в спирально-накатной
          воздухонагреватель рабочая среда непрерывно омывает внутренние стенки
          трубок, отдавая теплоту оребренным нагревательным элементам, которые
          охлаждаются перекрестным воздушным потоком. В отличие от паровых
          аппаратов, здесь процесс теплопередачи обусловлен температурным
          скольжением — непрерывным остыванием жидкости от подающей к обратной
          линии. Интенсивность этого переноса напрямую определяется величиной
          температурного напора, а также скоростями движения обеих сред:
          циркулирующего внутри прибора теплоносителя и нагнетаемого
          вентилятором наружного воздуха.
        </ProductParagraph>

        <div className="flex w-full flex-col gap-3 sm:flex-row sm:gap-0">
          <div className="relative aspect-1000/650 w-full">
            <Image
              src="/img/general_pages/voda_kalorifer_3_4.png"
              alt="Воздухонагреватель с теплоносителем вода"
              title="Водяной воздухонагреватель биметаллический"
              fill
            />
          </div>
          <div className="relative aspect-1000/650 w-full">
            <Image
              src="/img/general_pages/voda_kalorifer_4.png"
              alt="Теплообменник многоходовой"
              title="Водяной теплообменник оребренный"
              fill
            />
          </div>
        </div>

        <ProductParagraph>
          Поскольку вода остывает по мере продвижения от подающего патрубка к
          отводящему, температурное поле по высоте фронтальной поверхности
          нагрева распределяется неравномерно, плавно снижаясь по ходам к
          стороне выхода теплоносителя. Для сохранения проектной эффективности
          теплообмена и предотвращения критического температурного расслоения
          внутреннее пространство гидравлического тракта должно быть полностью
          заполнено устойчивым и непрерывным потоком жидкости, гарантирующим
          расчетную турбулизацию. Если происходит завоздушивание отдельных
          ходов, проток жидкости в них полностью блокируется. При критическом же
          падении общего расхода теплоносителя его движение в трубках переходит
          в ламинарный режим, при котором коэффициент теплоотдачи падает. Любой
          из этих нештатных факторов нарушает проектную гидродинамику прибора,
          вызывает неравномерный прогрев и локальное переохлаждение элементов,
          что ведет к падению номинальной мощности калорифера и резко
          увеличивает риск его размораживания.
        </ProductParagraph>

        <LinkButtonsBlock
          buttons={[
            {
              url: "/raschet-podbor-kaloriferov#anchor2",
              name: "Расчет площади сечения",
              hiddenText:
                "Расчет площади фронтального сечения от массовой скорости",
            },
            {
              url: "/koefficient-teploperedachi-kaloriferov",
              name: "Коэффициент теплопередачи",
              hiddenText:
                "Коэффициент теплопередачи водяного воздухонагревателя",
            },
          ]}
        />

        <div className="bg-primary-dark/50 mx-auto h-1 w-2/3 rounded-full mask-[linear-gradient(to_right,transparent,black,transparent)]" />

        {/* Энергоемкость подающей и обратной линий */}
        <section className="text-[#5a769a]">
          <NumberedAnchor num={1} />
          <Heading lvl={3} text="Энергоемкость подающей и обратной линий" />

          <p>
            В промышленных системах вентиляции энергоемкость контура жестко
            регламентируется графиком тепловой сети. В зависимости от источника
            это может быть как низкопотенциальный индивидуальный режим
            (например, 60/40 °C или 70/50 °C), так и классический
            централизованный (95/70 °C) либо высокотемпературный (150/70 °C).
            Проходя по внутренним каналам трубок, горячая или перегретая вода
            интенсивно остывает, отдавая накопленное тепло наружному воздуху, и
            возвращается в обратную магистраль. Объем переданной мощности прямо
            пропорционален разности энтальпий. Так, при эксплуатации
            оборудования на графике 90/70 °C каждый килограмм циркулирующего
            объема отдает разницу между 377 и 293 кДж, что высвобождает 84 кДж
            полезной тепловой энергии. Соответственно, чем выше температура
            подающей линии и шире этот температурный коридор, тем меньший
            массовый расход жидкости требуется для обеспечения расчетного
            нагрева здания, что позволяет существенно сэкономить на диаметрах
            трубопроводов и мощности насосного оборудования.
          </p>
        </section>

        <WaterPropsOnSaturationLineTable />

        <div className="bg-primary-dark/50 mx-auto h-1 w-2/3 rounded-full mask-[linear-gradient(to_right,transparent,black,transparent)]" />

        {/* Рабочее давление и температура кипения */}
        <section className="text-[#5a769a]">
          <Heading lvl={3} text="Рабочее давление и температура кипения" />
          <ProductParagraph className="text-base">
            При нормальных условиях верхний температурный предел использования
            воды ограничен точкой ее закипания при 100 °C. Однако температура
            перехода жидкости в газообразное состояние напрямую коррелирует с
            давлением внутри системы. При его повышении этот порог смещается
            вверх, что позволяет нагревать рабочую среду без риска ее вскипания.
            Так, для сохранения стабильного жидкостного состояния контура при
            120 °C минимальное избыточное давление в калорифере должно
            составлять не менее 0.1 МПа. Повышение температуры рабочей среды до
            130 °C потребует на манометре уже 0.17 МПа, а в пиковых режимах
            высокотемпературных магистралей при 150 °C система должна находиться
            под давлением не менее 0.38 МПа. Поддержание параметров выше этих
            критических значений полностью исключает аварийный срыв циркуляции.
            Находящаяся под таким избыточным подпором вода называется перегретой
            и применяется в качестве высокопотенциального промышленного
            теплоносителя.
          </ProductParagraph>
        </section>

        <LinkButtonsBlock
          buttons={[
            {
              url: "/koefficient-teploperedachi-kaloriferov#anchor1",
              name: "Сопротивление по воздуху",
              hiddenText:
                "Расчет потерь давления по воздуху в водяных калориферах",
            },
            {
              url: "/gidravlicheskoe-soprotivlenie-kaloriferov",
              name: "Сопротивление по воде",
              hiddenText:
                "Расчет гидравлического сопротивления водяных калориферов",
            },
          ]}
        />
      </section>
    </>
  );
}
