// prettier-ignore
const tableRows = [
  [40, 992, 4.174, 168, 40, 0.635, 0.659, 0, 0],
  [45, 990, 4.174, 188, 45, 0.642, 0.605, 0, 0],
  [50, 988, 4.174, 209, 50, 0.648, 0.556, 0, 0],
  [55, 986, 4.176, 230, 55, 0.654, 0.514, 0, 0],
  [60, 983, 4.179, 251, 60, 0.659, 0.478, 0, 0],
  [65, 981, 4.183, 272, 65, 0.664, 0.444, 0, 0],
  [70, 978, 4.187, 293, 70, 0.668, 0.415, 0, 0],
  [75, 975, 4.191, 314, 75, 0.671, 0.388, 0, 0],
  [80, 972, 4.195, 335, 80, 0.674, 0.365, 0, 0],
  [85, 969, 4.201, 356, 85, 0.677, 0.344, 0, 0],
  [90, 965, 4.208, 377, 90, 0.680, 0.326, 0, 0],
  [95, 962, 4.214, 398, 95, 0.682, 0.310, 0, 0],
  [100, 958, 4.220, 419, 100, 0.683, 0.295, 0, 0],
  [105, 955, 4.226, 440, 105, 0.684, 0.281, 0.19, 0.019],
  [110, 951, 4.233, 461, 110, 0.685, 0.268, 0.42, 0.042],
  [115, 947, 4.239, 483, 115, 0.685, 0.256, 0.68, 0.068],
  [120, 943, 4.245, 504, 120, 0.685, 0.246, 0.97, 0.097],
  [130, 935, 4.262, 546, 131, 0.685, 0.227, 1.69, 0.169],
  [140, 926, 4.283, 589, 141, 0.684, 0.211, 2.60, 0.260],
  [150, 917, 4.308, 632, 151, 0.681, 0.197, 3.75, 0.375]
]

export default function WaterPropsOnSaturationLineTable() {
  return (
    <div className="w-full overflow-x-auto">
      <table className="w-full min-w-231 xl:min-w-auto">
        <thead>
          <tr>
            <th className="p-1 uppercase" colSpan={9}>
              Свойства воды на линии насыщения в зависимости от температуры
            </th>
          </tr>
          <tr>
            <th className="p-1">Температура</th>
            <th className="p-1">Плотность</th>
            <th className="p-1">Теплоемкость</th>
            <th className="p-1" colSpan={2}>
              Удельная энтальпия воды
            </th>
            <th className="p-1">Коэффициент теплопроводности</th>
            <th className="p-1">Кинематическая вязкость</th>
            <th className="p-1" colSpan={2}>
              Минимальное избыточное давление против вскипания
            </th>
          </tr>
          <tr>
            <th className="w-18 p-1">°C</th>
            <th className="w-18 p-1">
              кг/м<sup>3</sup>
            </th>
            <th className="w-18 p-1">кДж/(кг•°C)</th>
            <th className="w-18 p-1">кДж/кг</th>
            <th className="w-18 p-1">ккал/кг</th>
            <th className="w-18 p-1">Вт/(м·°C)</th>
            <th className="w-18 p-1">
              мм<sup>2</sup>/с
            </th>
            <th className="w-18 p-1">бар</th>
            <th className="w-18 p-1">МПа</th>
          </tr>
        </thead>
        <tbody>
          {tableRows.map((tr, idx) => (
            <tr key={idx}>
              {tr.map((td, idx) => (
                <td key={idx} className="p-0.5">
                  {td}
                </td>
              ))}
            </tr>
          ))}
        </tbody>
      </table>
    </div>
  );
}
