import type { Metadata } from "next";
import Image from "next/image";

import Heading from "@/components/general_pages/heading";
import ProductParagraph from "@/components/catalog/productParagraph";
import CategoryCards from "@/components/categoryCards";
import LinkButtonsBlock from "@/components/linkButtonsBlock";

export const metadata: Metadata = {
  title:
    "Производство водяных и паровых промышленных калориферов | Завод Т.С.Т.",
  description:
    "Водяные и паровые промышленные калориферы производства ООО «Т.С.Т.». Технические параметры, конструктивные особенности и модельный ряд воздухонагревателей серий КСк, КПСк, ТВВ, КП и КФБ-А",
  keywords:
    "калорифер,изготовление калориферов,производство воздухонагревателей,калориферы производитель,калорифер промышленный,воздухонагреватели промышленные,производство промышленных калориферов,модели калориферов,каталог калориферов,калориферы для холодного климата",
};

const kaloriferyCategories = [
  [
    {
      name: "Калориферы КПВС КПВУ",
      url: "/kalorifery-voda",
      img: "/img/produkciya/kalorifery/kalorifer_kpvs_kpvu.png",
    },
    {
      name: "Калориферы КППС КППУ",
      url: "/kalorifery-par",
      img: "/img/produkciya/kalorifery/kalorifer_kpps_kppu.png",
    },
    {
      name: "Калориферы КСк",
      url: "/kalorifery-ksk",
      img: "/img/produkciya/kalorifery/kalorifer_ksk.png",
    },
    {
      name: "Калориферы КПСк",
      url: "/kalorifery-kpsk",
      img: "/img/produkciya/kalorifery/kalorifer_kpsk.png",
    },
  ],
  [
    {
      name: "Калориферы ТВВ",
      url: "/kalorifery-tvv",
      img: "/img/produkciya/kalorifery/kalorifer_tvv.png",
    },
    {
      name: "Калориферы КП",
      url: "/kalorifery-kp",
      img: "/img/produkciya/kalorifery/kalorifer_kp.png",
    },
    {
      name: "Калориферы КФБ М",
      url: "/kalorifery-kfb-a",
      img: "/img/produkciya/kalorifery/kalorifer_kfb-m.png",
    },
    {
      name: "Калориферы КФБ П",
      url: "/kalorifery-kfb",
      img: "/img/produkciya/kalorifery/kalorifer_kfb-p.png",
    },
  ],
];

export default function KaloriferyPage() {
  return (
    <article className="@container flex w-full flex-col space-y-6">
      <Heading lvl={1} text="Калориферы промышленные" />

      <ProductParagraph>
        Завод отопительного оборудования ООО «Т.С.Т.» предлагает комплексные
        инженерные решения в сфере промышленного нагрева воздуха. Представленная
        техническая информация позволяет детально ознакомиться с принципами
        работы теплообменного оборудования, внутренним устройством оребренных
        модулей и спецификой эксплуатации каждой серии калориферов на различных
        типах энергоносителей. Ниже вы найдете классификацию серийного
        модельного ряда и базовые принципы подбора воздухонагревателей для
        объектов любой сложности.
      </ProductParagraph>

      <section>
        <Heading lvl={2} text="Назначение калориферов" />
        <ProductParagraph>
          Калориферы – поверхностные теплообменники рекуперативного типа,
          предназначенные для нагревания воздуха в системах приточной вентиляции
          и воздушного отопления, создания технологического тепла для сушильных
          камер и производственных линий, рециркуляционного охлаждения жидкостей
          промышленного оборудования. В качестве первичного теплоносителя
          выступают горячая вода, концентрированные растворы гликолей, сухой
          насыщенный пар.
        </ProductParagraph>
      </section>

      <LinkButtonsBlock
        buttons={[
          {
            name: "Онлайн-подбор водяных ТО",
            url: "/kalorifery-voda#anchor1",
            hiddenText: "Онлайн-расчет и подбор водяных калориферов ООО Т.С.Т.",
          },
          {
            name: "Онлайн-подбор паровых ТО",
            url: "/kalorifery-par#anchor1",
            hiddenText: "Онлайн-расчет и подбор паровых калориферов ООО Т.С.Т.",
          },
        ]}
      />

      <section>
        <Heading lvl={2} text="Производство калориферов" />
        <ProductParagraph>
          Разработка и изготовление специализированных промышленных
          воздухонагревателей — ключевая компетенция нашего предприятия. На
          производственных мощностях завода изготавливаются биметаллические
          теплообменники следующих серий: КПВС, КПВУ, КСк, ТВВ, КФБ-А М, КППС,
          КППУ, КПСк, КП, КФБ-А П.
        </ProductParagraph>
      </section>

      <section className="space-y-4">
        <div className="mb-6 flex w-full flex-col gap-3 sm:flex-row sm:gap-10">
          <div className="relative aspect-24/17 w-full">
            <Image
              src="/img/produkciya/kalorifery/kalorifer.png"
              alt="Калорифер водяной - конструкция"
              title="Калорифер водяной"
              fill
            />
          </div>
          <div className="relative aspect-24/17 w-full">
            <Image
              src="/img/produkciya/kalorifery/kalorifery_vodianye_parovye.png"
              alt="Калорифер паровой - конструкция"
              title="Калорифер паровой"
              fill
            />
          </div>
        </div>

        <Heading lvl={2} text="Конструкция калориферов" />
        <ProductParagraph>
          Конструктивно калориферы представляют собой модуль квадратного или
          прямоугольного сечения с несколькими рядами теплообменных элементов,
          объединенных общим гидравлическим трактом. Нагревательные элементы
          состоят из несущих металлических трубок. Для увеличения площади
          теплообмена, интенсивности теплоотдачи и повышения коррозионной
          стойкости на несущие трубки накатывается алюминиевое оребрение.
        </ProductParagraph>
      </section>

      <div className="bg-primary-dark/50 mx-auto h-1 w-2/3 rounded-full mask-[linear-gradient(to_right,transparent,black,transparent)]" />

      <section>
        <Heading lvl={2} text="Виды калориферов" />
        <ProductParagraph className="mb-4">
          Внутреннее устройство распределительных коллекторов определяет деление
          калориферов на одноходовые, используемые преимущественно для пара, и
          многоходовые — для жидких сред. В первом случае среда проходит по
          трубкам параллельно в один поток, что требует вертикальной ориентации
          теплообменного пучка для эффективного отвода конденсата. Принцип
          работы многоходовых моделей предполагает собой многократное
          последовательное движение теплоносителя; калориферы размещаются с
          горизонтальным расположением нагревательных элементов.
        </ProductParagraph>

        <LinkButtonsBlock
          buttons={[
            {
              name: "Водяной калорифер",
              url: "/kalorifer-voda",
              hiddenText:
                "Техническое описание и принцип работы водяного калорифера",
            },
            {
              name: "Паровой калорифер",
              url: "/kalorifer-par",
              hiddenText:
                "Техническое описание и принцип работы парового калорифера",
            },
          ]}
        />
      </section>

      {/* Секция "Типы калориферов" с подсекциями */}
      <section className="space-y-6">
        <Heading lvl={2} text="Типы калориферов" />
        <ProductParagraph>
          Калориферы каждой серийной группы классифицируют по номерам,
          определяющим их габариты и производительность по воздуху.
          Теплообменники одного типоразмера подразделяются по глубине на
          двухрядные, трехрядные и четырехрядные модификации. С увеличением
          рядности возрастает тепловая мощность воздухонагревателя, но
          одновременно повышается его аэродинамическое сопротивление.
        </ProductParagraph>

        <LinkButtonsBlock
          buttons={[
            {
              name: "Расчет водяных калориферов",
              url: "/raschet-podbor-kaloriferov",
              hiddenText:
                "Пошаговый расчет водяных калориферов производства ООО Т.С.Т.",
            },
            {
              name: "Расчет паровых калориферов",
              url: "/podbor-raschet-kaloriferov",
              hiddenText:
                "Пошаговый расчет паровых калориферов производства ООО Т.С.Т.",
            },
          ]}
        />

        <div className="bg-primary-dark/50 mx-auto h-1 w-2/3 rounded-full mask-[linear-gradient(to_right,transparent,black,transparent)]" />

        <section>
          <Heading lvl={3} text="Приточные калориферы" />
          <ProductParagraph>
            Серийная линейка приточных водяных и паровых калориферов КПВС, КПВУ,
            КППС и КППУ насчитывает 288 моделей с небольшим шагом размерности и
            производительности каждого последующего номера. Широкий модельный
            ряд позволяет точно подобрать теплообменники под помещение любой
            площади – от небольших гаражей и мастерских до крупных заводских
            цехов и производственных ангаров. Встроенный онлайн-калькулятор на
            разные виды теплоносителей обеспечивает наиболее точный выбор
            воздухонагревателя под конкретные инженерные задачи.
          </ProductParagraph>
        </section>
        <CategoryCards
          categories={kaloriferyCategories[0]}
          cardClassName="2xl:text-sm xl:px-3"
        />
        <section className="space-y-6">
          <Heading lvl={3} text="Стандартные калориферы" />
          <ProductParagraph>
            Водяные и паровые биметаллические калориферы серии КСк и КПСк
            выпускаются с несущими трубками диаметром 16 мм. Общий модельный ряд
            состоит из 72 типоразмеров с производительностью по воздуху от двух
            до двадцати пяти тысяч кубических метров в час.
          </ProductParagraph>

          <LinkButtonsBlock
            buttons={[
              {
                name: "Методика подбора калориферов",
                url: "/raschet-kaloriferov",
                hiddenText:
                  "Критерии расчета водяных паровых и электрических калориферов",
              },
              {
                name: "Калориферы для сушки",
                url: "/kalorifer-sushilnaia-kamera",
                hiddenText: "Расчет и подбор калориферов для сушильных камер",
              },
            ]}
          />

          <section>
            <Heading lvl={3} text="Калориферы для низких температур" />
            <ProductParagraph>
              При эксплуатации теплообменников в неблагоприятных условиях, с
              высокой степенью загрязненности теплоносителя и воздуха, низких
              температурных режимах целесообразно применение промышленных
              калориферов ТВВ и КП с несущими трубками увеличенного диаметра. К
              преимуществам их работы относится минимальный риск зарастания
              внутренней полости трубок накипью и нерастворимыми отложениями,
              что предотвращает перекрытие проходного сечения и последующее
              размораживание оборудования. Увеличенный шаг и повышенная толщина
              алюминиевого ребра способствуют меньшему забиванию межреберного
              пространства грязью или пылью, а также существенно снижают
              вероятность механической деформации теплообменных элементов в
              процессах транспортировки, монтажа и последующей эксплуатации.
            </ProductParagraph>
          </section>
          <CategoryCards
            categories={kaloriferyCategories[1]}
            cardClassName="2xl:text-sm xl:px-3"
          />
        </section>

        <section>
          <Heading lvl={3} text="Калориферы для шахт и рудников" />
          <ProductParagraph>
            Промышленные калориферы серии КФБ-А производства предприятия ООО
            «Т.С.Т.» представляют собой индустриальные воздухонагреватели,
            работающие на пару, горячей и перегретой воде. Благодаря оптимальным
            габаритам и устойчивости трубного пучка к термическим деформациям,
            теплообменники данной серии являются наиболее подходящим решением
            для сборки высокопроизводительных калориферных установок в
            климатических зонах с расчетной зимней температурой ниже минус 30
            °C. Высокая эксплуатационная надежность и стабильность теплоотдачи
            способствуют активному внедрению оборудования этой серии на объектах
            шахт, рудников и обогатительных фабрик в горнодобывающей и
            металлургической отраслях.
          </ProductParagraph>
        </section>
      </section>

      <LinkButtonsBlock
        buttons={[
          {
            name: "Секции технагрева: водяные ТО",
            url: "/raschet-podbor-kaloriferov#anchor14",
            hiddenText:
              "Расчет и подбор многорядных блоков водяных калориферов",
          },
          {
            name: "Секции технагрева: паровые ТО",
            url: "/podbor-raschet-kaloriferov#anchor12",
            hiddenText:
              "Расчет и подбор многорядных блоков паровых калориферов",
          },
        ]}
      />
    </article>
  );
}
