import type { Metadata } from "next";

import Spoiler from "@/components/ui/spoiler";
import Heading from "@/components/general_pages/heading";
import { Separator } from "@/components/ui/separator";
import ProductParagraph from "@/components/catalog/productParagraph";
import Link from "next/link";
import { ArrowBigDownDash } from "lucide-react";

export const metadata: Metadata = {
  title: "Расчет и подбор блоков калориферов для технологического нагрева",
  description:
    "Инженерный расчет многорядных секций водяных калориферов по методу NTU. Сравнение противоточной, прямоточной и перекрестной схем для технологической сушки",
  keywords:
    "калориферы для технологического нагрева,расчет водяных калориферов для технологического нагрева,подбор водяных воздухонагревателей в секции нагрева,многорядный нагрев калориферами,перекрестноточная схема воздухонагревательных блоков,прямоточная схема воздухонагревательных секций,противоточная схема теплообменников для нагрева,блок водяных калориферов для сушильных камер,аэродинамическое сопротивление калориферного блока,гидравлическое сопротивление калориферных секций",
};

const SPOILER_CONTENT_CLASS =
  "space-y-4 rounded bg-[rgb(233,239,247)] px-5 py-3 inset-shadow-sm mt-4";

export default function KaloriferBlocksPage() {
  return (
    <>
      <Heading
        lvl={1}
        text="Расчет калориферных блоков для технологического нагрева"
      />

      <ProductParagraph>
        Сравнительный анализ по расчету и подбору калориферных блоков для
        технологического нагрева, сушильных камер и высокотемпературных
        вентиляционных систем. На странице представлены данные тепловой
        мощности, расхода теплоносителя и температурных параметров воздуха для
        различных конфигураций оборудования. Приведены готовые показатели,
        позволяющие оценить фактическое аэродинамическое сопротивление
        калориферного блока и гидравлическое сопротивление калориферных секций.
        Подробно рассмотрен подбор водяных воздухонагревателей в секции нагрева
        при последовательном и параллельном подключении оборудования по воде, а
        также определены границы применимости прямоточной, противоточной и
        перекрестноточной схем обвязки.
      </ProductParagraph>

      <div className="space-y-1">
        <ProductParagraph>
          Навигация по аналитическим и расчетным разделам темы:
        </ProductParagraph>
        <ul className="space-y-1.5">
          {[
            "специфика работы многорядных калориферных блоков",
            "интегральный метод расчета блоков по NTU",
            "выбор оптимальной схемы гидравлической обвязки",
            "расчет параллельно-перекрестной схемы обвязки",
            "расчет последовательной прямоточной схемы обвязки",
            "расчет последовательной противоточной схемы обвязки",
            "эксплуатационные параметры и критические нагрузки секций",
            "выбор оборудования под температурные режимы сушки",
          ].map((item, i, arr) => (
            <li key={item} className="flex gap-2">
              <Link
                href={`/raschet-podbor-kaloriferov#anchor${i + 1}`}
                className="text-primary-darker hover:text-primary-dark flex font-bold"
              >
                <ArrowBigDownDash />
                <span>{i + 1}.</span>
              </Link>
              <span>
                {item}
                {i < arr.length - 1 ? ";" : "."}
              </span>
            </li>
          ))}
        </ul>
      </div>

      {/* Физика многорядного нагрева в условиях технологического процесса */}
      <section className="space-y-4">
        <Heading
          lvl={2}
          text="Физика многорядного нагрева в условиях технологического процесса"
        />

        <ProductParagraph>
          Применение стандартных пошаговых методик проектирования к многорядным
          установкам глубокого нагрева приводит к расхождениям с реальными
          эксплуатационными показателями. Это обусловлено рядом специфических
          аэродинамических и теплотехнических факторов, проявляющихся
          исключительно при последовательном прохождении воздушного потока через
          несколько ступеней.
        </ProductParagraph>

        {/* Специфика расчета и подбора многорядных калориферных блоков */}
        <section>
          <Spoiler
            title={
              <Heading
                lvl={3}
                text="Специфика расчета и подбора многорядных калориферных блоков"
              />
            }
            contentClassName={SPOILER_CONTENT_CLASS}
          >
            <MultiRowHeaterSelectionInfo />
          </Spoiler>
        </section>
      </section>

      {/* Интегральный метод NTU и уравнения эффективности Кэйса-Босмана */}
      <section className="space-y-4">
        <Heading
          lvl={2}
          text="Интегральный метод NTU и уравнения эффективности Кэйса-Босмана"
        />

        <ProductParagraph>
          Применение интегрального метода NTU (число единиц переноса тепла)
          позволяет рассматривать многорядный калориферный блок как единый
          монолитный теплообменный массив. В отличие от пошаговых инженерных
          методик, данный подход учитывает реальное физическое смешение потоков
          в общем коллекторе и исключает возникновение математических невязок,
          обеспечивая точный расчет параметров установки на основе законов
          сохранения массы и энергии.
        </ProductParagraph>

        {/* Базовый алгоритм и общая математическая модель блока */}
        <section className="space-y-4">
          <Heading
            lvl={3}
            text="Базовый алгоритм и общая математическая модель блока"
          />

          <ProductParagraph>
            Интегральный метод NTU/КПД позволяет оперативно рассчитать общую
            мощность и конечные температурные параметры многорядного блока без
            применения итерационных циклов определения промежуточных
            характеристик сред. Расчет выполняется последовательно: от массовых
            расходов и конструктивной геометрии оборудования к финальным
            температурным показателям.
          </ProductParagraph>

          {/* Формулы расчета многорядного блока */}
          <section>
            <Spoiler
              title={
                <Heading lvl={3} text="Формулы расчета многорядного блока" />
              }
              contentClassName={SPOILER_CONTENT_CLASS + " text-example"}
            >
              <MultiRowBlockFormulas />
            </Spoiler>
          </section>
        </section>
      </section>

      {/* Технический вывод по гидравлическим режимам работы */}
      <section>
        <Spoiler
          title={
            <Heading
              lvl={3}
              text="Технический вывод по гидравлическим режимам работы"
            />
          }
          contentClassName={SPOILER_CONTENT_CLASS}
        >
          <HydraulicOperatingModesAnalysis />
        </Spoiler>
      </section>

      {/* Критерии подбора количества рядов в калориферах */}
      <section>
        <Spoiler
          title={
            <Heading
              lvl={3}
              text="Критерии подбора количества рядов в калориферах"
            />
          }
          contentClassName={SPOILER_CONTENT_CLASS}
        >
          <HeaterRowSelectionCriteria />
        </Spoiler>
      </section>

      {/* Порядный расчет по ступеням нагрева */}
      <section>
        <Spoiler
          title={<Heading lvl={3} text="Порядный расчет по ступеням нагрева" />}
          contentClassName={SPOILER_CONTENT_CLASS + " text-example"}
        >
          <HeatingStageCalculations />
        </Spoiler>
      </section>

      {/* Формулы расчета перекрестного тока */}
      <section>
        <Spoiler
          title={<Heading lvl={3} text="Формулы расчета перекрестного тока" />}
          contentClassName={SPOILER_CONTENT_CLASS + " text-example"}
        >
          <CrossFlowFormulas />
        </Spoiler>
      </section>

      {/* Интегральный расчет по методу NTU - 1 */}
      <section>
        <Spoiler
          title={<Heading lvl={3} text="Интегральный расчет по методу NTU" />}
          contentClassName={SPOILER_CONTENT_CLASS + " text-example"}
        >
          <NTUIntegralCalculation1 />
        </Spoiler>
      </section>

      {/* Сравнительный анализ методов расчета */}
      <section>
        <Spoiler
          title={
            <Heading lvl={3} text="Сравнительный анализ методов расчета" />
          }
          contentClassName={SPOILER_CONTENT_CLASS}
        >
          <CalculationMethodsComparison />
        </Spoiler>
      </section>

      {/* Формулы расчета прямотока */}
      <section>
        <Spoiler
          title={<Heading lvl={3} text="Формулы расчета прямотока" />}
          contentClassName={SPOILER_CONTENT_CLASS + " text-example"}
        >
          <ParallelFlowFormulas />
        </Spoiler>
      </section>

      {/* Интегральный расчет по методу NTU - 2 */}
      <section>
        <Spoiler
          title={<Heading lvl={3} text="Интегральный расчет по методу NTU" />}
          contentClassName={SPOILER_CONTENT_CLASS + " text-example"}
        >
          <NTUIntegralCalculation2 />
        </Spoiler>
      </section>

      {/* Формулы расчета противотока */}
      <section>
        <Spoiler
          title={<Heading lvl={3} text="Формулы расчета противотока" />}
          contentClassName={SPOILER_CONTENT_CLASS + " text-example"}
        >
          <CounterFlowFormulas />
        </Spoiler>
      </section>

      {/* Интегральный расчет по методу NTU - 3 */}
      <section>
        <Spoiler
          title={<Heading lvl={3} text="Интегральный расчет по методу NTU" />}
          contentClassName={SPOILER_CONTENT_CLASS + " text-example"}
        >
          <NTUIntegralCalculation3 />
        </Spoiler>
      </section>
    </>
  );
}

/* Специфика расчета и подбора многорядных калориферных блоков */
function MultiRowHeaterSelectionInfo() {
  return (
    <>
      {/* Термодинамическое затухание температурного напора по глубине пучка */}
      <section className="space-y-2">
        <Heading
          lvl={4}
          text="Термодинамическое затухание температурного напора по глубине пучка"
        />

        <p>
          Параллельная по воде перекрестноточная схема обвязки многорядных
          блоков воздухонагревателей серии КФБ-12 А М предусматривает
          индивидуальную подачу теплоносителя с максимальной начальной
          температурой +95 °C на каждую ступень. Это конструктивное решение
          минимизирует термодинамическое затухание по глубине установки,
          позволяя эффективно использовать поверхность нагрева на последующих
          рядах и достигать предельно высоких температурных параметров воздуха.
        </p>

        <p>
          Вместе с тем, специфика ступенчатого охлаждения сред и переменного
          расхода воды в параллельных контурах выдвигает особые требования к
          гидравлической увязке и аэродинамическим характеристикам приточной
          системы. Теплотехнический анализ параллельной схемы подключения
          многорядных блоков воздухонагревателей показывает выраженное влияние
          затухания температурного напора в крайних ступенях. В обычном режиме
          на долю 4-го ряда приходится всего 10% мощности у модели А3 М
          (прибавка +6 °C) и 6% мощности у модели А4 М (прибавка всего +4 °C).
        </p>

        <p>
          Последовательная прямоточная схема обвязки многорядных блоков
          характеризуется жесткими физическими ограничениями, обусловленными
          соосным движением сред. В отличие от параллельно-перекрестного тока,
          где на каждую ступень индивидуально подается теплоноситель с начальной
          максимальной температурой +95 °C, в прямотоке вода движется по
          трубному пучку последовательно, охлаждаясь от ряда к ряду. Это
          приводит к падению температурного напора по мере продвижения
          воздушного потока по глубине установки.
        </p>
      </section>

      {/* Искусственное занижение массового расхода воздуха */}
      <section className="space-y-2">
        <Heading
          lvl={4}
          text="Искусственное занижение массового расхода воздуха"
        />

        <p>
          Порядный расчет рассматривает блок как цепочку изолированных ступеней
          по воздуху. Метод оптимален для моделирования обычного (балансового)
          режима, так как позволяет задавать жесткие условия по обратке для
          каждого ряда индивидуально и вычислять точечное зажатие локального
          расхода автоматикой. Однако при фиксации сквозного транзитного расхода
          (форсированный режим) этот метод приводит к математическим невязкам на
          конечных ступенях.
        </p>

        <p>
          Причины расхождения результатов и точность данных кроются в расчетных
          параметрах: в порядном расчете каждый ряд считается индивидуально с
          привязкой к базовому объемному расходу и падающей локальной плотности
          нагретого воздуха. Это приводит к последовательному снижению расчетной
          массы на конечных рядах (до 26 500–26 000 кг/ч) и занижению итоговой
          мощности блока на 5–13% по сравнению с интегральными моделями, где
          массовый расход воздуха строго зафиксирован как константа (31 250
          кг/ч) для всех рядов согласно закону сохранения массы. В порядном
          расчете суммарное сопротивление блоков составляет 767–783 Па для А3 М
          и 1000–1012 Па для А4 М, так как расчет ведется по заниженной массе.
        </p>
      </section>

      {/* Риски ламинарного режима и аварийного завоздушивания хвостовых рядов */}
      <section className="space-y-2">
        <Heading
          lvl={4}
          text="Риски ламинарного режима и аварийного завоздушивания хвостовых рядов"
        />

        <p>
          В порядном расчете коэффициент теплопередачи конечных рядов падает до
          минимальных значений (58.4...61.1 Вт/(м²·°C)) из-за искусственного
          зажимания расхода и падения скорости воды до ламинарных 0.08–0.15 м/с.
          Из-за падения скорости воды до критических 0.15 м/с в А3 М и 0.08 м/с
          в А4 М конечные ряды в обычном режиме превращаются в зону
          гидравлического риска (застой и завоздушивание).
        </p>

        <p>
          Значение 0.08–0.15 м/с находится в критической зоне. В теплообменных
          элементах гарантированно возникнет ламинарное течение и завоздушивание
          верхних частей трубок. В результате часть теплообменника полностью
          отключится из работы, начнется лавинообразное падение общей мощности,
          а тепловой контур потеряет стабильность из-за снижения регулирующей
          способности арматуры.
        </p>
      </section>
    </>
  );
}

/* Формулы расчета многорядного блока */
function MultiRowBlockFormulas() {
  return (
    <>
      {/* Методика интегрального расчета блоков по методу NTU */}
      <Heading
        lvl={4}
        text="Методика интегрального расчета блоков по методу NTU"
        className="text-black"
      />

      <ol className="space-y-4">
        <li>
          <p>
            Шаг 1. Тепловая способность воздушного и водяного потоков (W, Вт/°C)
          </p>
          <p>
            Определяет количество тепловой энергии, необходимое для изменения
            температуры потока среды на 1 °C:
          </p>
          <ul>
            <li>• Воздушный поток: W_возд = (G_air / 3600) * 1006</li>
            <li>• Водяной поток: W_воды = (G_w_transit / 3600) * 4187</li>
          </ul>
          <p>
            Для проведения расчета выбирается наименьшее значение: W_min =
            W_возд
          </p>
          <p>
            На основании полученных величин вычисляется безразмерное отношение
            потоков: W_o = W_min / W_воды
          </p>
        </li>

        <li>
          <p>Шаг 2. Тепловой потенциал трубного пучка (NTU_block)</p>
          <p>
            Характеризует безразмерную тепловую способность всей площади
            поверхности нагрева установки относительно массового расхода
            воздуха:
          </p>
          <ul>
            <li>• NTU_block = (K_average * F_общ) / W_min</li>
          </ul>
          <p>
            Где: F_общ — суммарная площадь поверхности теплообмена всех четырех
            калориферов блока, м²; K_average — средний коэффициент теплопередачи
            оборудования, Вт/(м²·°C).
          </p>
        </li>

        <li>
          <p>Шаг 3. Итоговый тепловой КПД установки (E_block)</p>
          <p>
            Зависит от схемы движения теплоносителей и рассчитывается по
            интегральным зависимостям Кэйса-Босмана для неперемешивающихся сред:
          </p>
          <ul>
            <li>
              Перекрестноточная схема:{" "}
              <span className="block">
                E_block = 1 - exp((NTU_block^0.22 / W_o) * (exp(-W_o *
                NTU_block^0.78) - 1))
              </span>
            </li>
            <li>
              Последовательная прямоточная схема:{" "}
              <span className="block">
                E_block = (1 - exp(-NTU_block * (1 + W_o))) / (1 + W_o)
              </span>
            </li>
            <li>
              Последовательная противоточная схема:{" "}
              <span className="block">
                E_block = (1 - exp(-NTU_block * (1 - W_o))) / (1 - W_o *
                exp(-NTU_block * (1 - W_o)))
              </span>
            </li>
          </ul>
        </li>

        <li>
          <p>Шаг 4. Расчет финальных паспортных параметров</p>
          <ul>
            <li>
              • Общая тепловая мощность блока: Q = W_min * E_block * (T_вх_воды
              - t_вх_возд)
            </li>
            <li>
              • Температура воздуха на выходе: t_out_air = t_вх_возд + Q /
              W_возд
            </li>
            <li>
              • Температура обратной воды: T_out_w = T_вх_воды - Q / W_воды
            </li>
          </ul>
        </li>
      </ol>
    </>
  );
}

/* Технический вывод по гидравлическим режимам работы */
function HydraulicOperatingModesAnalysis() {
  return (
    <>
      <p>
        Сопоставление обычного (балансового) и форсированного (полнорасходного)
        режимов параллельной перекрестноточной схемы определяет четкую
        теплотехническую закономерность. Разница между ними лежит в плоскости
        расхода сетевого теплоносителя и скорости его движения внутри трубок.
        Анализ работы оборудования при фиксации расхода воды на уровне константы
        первого ряда показывает гидравлические и температурные особенности
        форсирования перекрестноточной схемы.
      </p>

      {/* Обычный (балансовый) режим */}
      <section>
        <Heading lvl={4} text="Обычный (балансовый) режим" />
        <p>
          Расход воды на каждый последующий ряд принудительно зажимается
          автоматикой по мере промежуточного прогрева воздуха. Это позволяет
          строго выдерживать нормативный температурный перепад и возвращать в
          сеть обратку теплоносителя с температурой строго +70 °C. Схема
          минимизирует нагрузку на тепловую сеть, снижая суммарный расход воды
          до 16 020 кг/ч (для КФБ-12 А3 М) и до 17 250 кг/ч (для КФБ-12 А4 М).
        </p>
      </section>

      {/* Форсированный (полнорасходный) режим */}
      <section>
        <Heading lvl={4} text="Форсированный (полнорасходный) режим" />
        <p>
          Расход воды на каждый последующий ряд принудительно зажимается
          автоматикой по мере промежуточного прогрева воздуха. Это позволяет
          строго выдерживать нормативный температурный перепад и возвращать в
          сеть обратку теплоносителя с температурой строго +70 °C. Схема
          минимизирует нагрузку на тепловую сеть, снижая суммарный расход воды
          до 16 020 кг/ч (для КФБ-12 А3 М) и до 17 250 кг/ч (для КФБ-12 А4 М).
        </p>
      </section>

      {/* Основные критерии сопоставления режимов */}
      <section>
        <Heading lvl={4} text="Основные критерии сопоставления режимов" />

        <ol className="space-y-2">
          <li>
            <span className="text-example">1. Температурный выигрыш:</span>{" "}
            Отключение автоматического порядового зажатия воды и перевод блока
            на сквозной форсированный транзит обеспечивает существенное
            приращение конечных параметров воздуха. На 4-рядном блоке А3 М
            финишная температура возрастает с +67 °C до +75 °C (+8 градусов), а
            на блоке А4 М — с +71 °C до +82 °C (+11 градусов).
          </li>
          <li>
            <span className="text-example">
              2. Гидравлическая стабилизация контура:
            </span>{" "}
            Перевод конечных калориферов в полнорасходный режим полностью
            ликвидирует ламинарные зоны. Это исключает риски локального
            завоздушивания, делая систему гидравлически надежной без установки
            балансировочной арматуры по рядам.
          </li>
          <li>
            <span className="text-example">
              3. Технико-экономические издержки форсирования:
            </span>{" "}
            Максимальная интенсификация нагрева воздуха требует кратного
            увеличения общего протока теплоносителя через блок — до 30 000 кг/ч
            (для А3 М) и 36 200 кг/ч (для А4 М). Из-за высокой скорости транзита
            вода на 3-м и 4-м рядах не успевает полноценно остыть. В результате
            общая средневзвешенная обратка возвращается в сеть перегретой
            (+87...89 °C порядно или ~+81 °C средневзвешенная вместо нормативных
            +70 °C).
          </li>
          <li>
            <span className="text-example">
              4. Затухание на финише (Обычный режим):
            </span>{" "}
            Теплотехнический анализ параллельной схемы подключения многорядных
            блоков воздухонагревателей показывает выраженное влияние затухания
            температурного напора в крайних ступенях. В обычном режиме на долю
            4-го ряда приходится всего 10% мощности у модели А3 М (прибавка +6
            °C) и 6% мощности у модели А4 М (прибавка всего +4 °C). Из-за
            падения скорости воды до критических 0.15 м/с (в А3 М) и 0.08 м/с (в
            А4 М) конечные ряды в обычном режиме превращаются в зону
            гидравлического риска (застой и завоздушивание).
          </li>
        </ol>
      </section>

      {/* Гидравлические особенности параллельного коллектора */}
      <section>
        <Heading
          lvl={4}
          text="Гидравлические особенности параллельного коллектора"
        />
        <p>
          В отличие от последовательных схем обвязки, где сопротивления рядов
          суммируются линейно, параллельное распределение потока по коллектору
          перекрестного тока радикально снижает потери давления воды.
          Гидравлическое сопротивление 4-рядного блока падает до комфортных
          2.5–3.8 кПа в обычном режиме и фиксируется на уровне 9.1–11.0 кПа в
          форсированном режиме. Это полностью исключает необходимость применения
          высоконапорных циркуляционных насосов.
        </p>
      </section>
    </>
  );
}

/* Критерии подбора количества рядов в калориферах */
function HeaterRowSelectionCriteria() {
  return (
    <>
      <p>Основные аспекты выбора модификации:</p>

      <ol className="space-y-2">
        <li>
          <span className="text-example">
            1. Оценка эффективности теплоотдачи:
          </span>{" "}
          Модель КФБ-12 А4 М обладает развитой площадью поверхности нагрева
          одного прибора (63.7 м² против 48.2 м² у А3 М). В идентичных
          эксплуатационных режимах эта разница в конструктивном исполнении
          обеспечивает стабильное увеличение съема тепловой мощности на 53–56
          кВт и позволяет поднять финишную температуру приточного воздуха на
          6.0–6.4 °C (достигая +81.7 °C на пике форсажа).
        </li>

        <li>
          <span className="text-example">
            2. Аэродинамические ограничения (Критический фактор):
          </span>{" "}
          Отрицательной стороной использования модификации А4 М является
          существенный рост фронтального сопротивления пучка трубок. При
          массовой скорости воздушного потока 6.886 кг/(м²·с) 4-рядный блок А4 М
          создает суммарные потери давления воздуха в 1000–1226 Па (в
          зависимости от метода расчета и режима), что в среднем на 30% выше
          показателей блока А3 М (767–929 Па). Продавливание расширяющегося
          горячего воздуха через плотный пучок А4 М требует применения
          специализированных высоконапорных вентиляторов.
        </li>

        <li>
          <span className="text-example">
            3. Физические температурные границы:
          </span>
          <ul>
            <li>
              • Блок КФБ-12 А3 М: Из-за меньшей площади поверхности нагрева в
              обычном режиме (95/70 °C) обеспечивает стабильный нагрев воздуха
              только до +67...68.5 °C. Преодолеть порог в +70 °C на данной
              модификации возможно только при переходе в форсированный режим с
              избыточным расходом воды.
            </li>
            <li>
              • Блок КФБ-12 А4 М: За счет развитой поверхности теплообмена
              гарантированно преодолевает температурный барьер в +70 °C. В
              обычном режиме (95/70 °C) фиксируется стабильный показатель
              +70.7...+74.5 °C при сохранении нормативного возврата
              теплоносителя в сеть.
            </li>
          </ul>
        </li>

        <li>
          <span className="text-example">
            4. Инженерная рекомендация по подбору:
          </span>
          <ul>
            <li>
              • Целесообразно закладывать КФБ-12 А3 М, если: производительность
              вентиляционной системы ограничена по давлению (до 800–900 Па), а
              технологический процесс не требует конечных температур притока
              выше +65...67 °C. Это наиболее экономически оправданный и
              аэродинамически сбалансированный выбор.
            </li>
            <li>
              • Целесообразно закладывать КФБ-12 А4 М, если: проект требует
              достижения температур воздуха на уровне +71...82 °C, а приточная
              система изначально укомплектована высоконапорным вентилятором (с
              запасом давления выше 1300 Па).
            </li>
          </ul>
        </li>

        <li>
          <span className="text-example">
            5. Технологический предел по количеству калориферов в блоке:
          </span>{" "}
          Четыре ряда являются абсолютным технологическим пределом для данной
          схемы компоновки. В обычном режиме на долю 4-го ряда модели А4 М
          приходится всего 6% от общей мощности блока, а прибавка к температуре
          воздуха составляет символические 4 °C. Дальнейшее увеличение глубины
          теплообменника технически неэффективно из-за критического затухания
          температурного напора, в то время как потери давления воздуха превысят
          рабочий диапазон большинства стандартных вентиляционных систем.
        </li>
      </ol>
    </>
  );
}

/* Порядный расчет по ступеням нагрева */
function HeatingStageCalculations() {
  return (
    <>
      {/* КФБ-12 А3 М */}
      <div className="mb-8 space-y-2">
        <div>
          <p>
            КАЛОРИФЕР КФБ-12 А3 М ПЕРВОГО РЯДА. ПЕРЕКРЕСТНОТОЧНАЯ СХЕМА. НАГРЕВ
            ВОЗДУХА ОТ 10°C ДО 35°C
          </p>

          <ul>
            <li>t_in_air (Входящая температура воздуха) = 10.0 °C</li>
            <li>t_out_air (Температура воздуха на выходе) = 34.8 °C</li>
            <li>
              G_air (Массовый расход воздуха через установку) = 31250 кг/час
              (при rho = 1.25 кг/м³)
            </li>
            <li>
              v_air (Массовая скорость воздуха во фронтальном сечении) = 6.886
              кг/(м²·с)
            </li>
            <li>
              Q_ср (Средняя зафиксированная мощность ряда) = 218000 Вт (218 кВт)
            </li>
            <li>
              G_w (Необходимый расход воды на калорифер) = 7500 кг/час (2.0833
              кг/сек)
            </li>
            <li>W_w (Скорость движения воды в трубках) = 0.739 м/сек</li>
            <li>K (Коэффициент теплопередачи) = 77.175 Вт/(м²·°C)</li>
            <li>
              T_in_w (Температура горячей воды на входе из сети) = 95.0 °C
            </li>
            <li>
              T_out_w (Температура обратной воды на выходе из ряда) = 70.0 °C
            </li>
            <li>dT_Б (Большая дельта температур) = 95.0 - 34.80 = 60.2 °C</li>
            <li>dT_М (Меньшая дельта температур) = 70.0 - 10.0 = 60.0 °C</li>
            <li>
              dT_mean (Среднеарифметический напор сред, так как 60.2/60{"<"}
              =1.8) = 60.1 °С
            </li>
            <li>Delta_Pa (Аэродинамическое сопротивление) = 232 Па</li>
            <li>Delta_Pw (Гидравлическое сопротивление) = 11.0 кПа</li>
          </ul>
        </div>

        <div>
          <p>
            КАЛОРИФЕР КФБ-12 А3 М ВТОРОГО РЯДА. ПЕРЕКРЕСТНОТОЧНАЯ СХЕМА. РЕЖИМ
            95/70°С. НАГРЕВ ВОЗДУХА ОТ 35°C ДО 51°C
          </p>

          <ul>
            <li>t_in_air (Входящая температура воздуха) = 34.8 °C</li>
            <li>t_out_air (Температура воздуха на выходе) = 50.6 °C</li>
            <li>
              G_air (Массовый расход воздуха через 2 ряд) = 28750 кг/час (при
              rho = 1.15)
            </li>
            <li>
              v_air (Массовая скорость воздуха во фронтальном сечении) = 6.33
              кг/(м²·с)
            </li>
            <li>
              Q_ср (Средняя зафиксированная мощность ряда) = 128000 Вт (128 кВт)
            </li>
            <li>
              G_w (Необходимый расход воды на калорифер) = 4300 кг/час (1.1944
              кг/сек)
            </li>
            <li>W_w (Скорость движения воды в трубках) = 0.424 м/сек</li>
            <li>K (Коэффициент теплопередачи) = 70.123 Вт/(м²·°C)</li>
            <li>
              T_in_w (Температура горячей воды на входе из сети) = 95.0 °C
            </li>
            <li>
              T_out_w (Температура обратной воды на выходе из ряда) = 70.0 °C
            </li>
            <li>dT_Б (Большая дельта температур) = 95.0 - 50.6 = 44.4 °C</li>
            <li>dT_М (Меньшая дельта температур) = 70.0 - 34.8 = 35.2 °C</li>
            <li>
              dT_mean (Среднеарифметический напор сред, так как 44.4/35.2{"<"}
              =1.8) = 39.8 °С
            </li>
            <li>Delta_Pa (Аэродинамическое сопротивление) = 199 Па</li>
            <li>Delta_Pw (Гидравлическое сопротивление) = 3.6 кПа</li>
          </ul>
        </div>

        <div className="text-[#250e0d]">
          <p>
            КАЛОРИФЕР КФБ-12 А3 М ВТОРОГО РЯДА. ПЕРЕКРЕСТНОТОЧНАЯ СХЕМА.
            ФОРСИРОВАННЫЙ РЕЖИМ. НАГРЕВ ВОЗДУХА ОТ 35°C ДО 53°C
          </p>

          <ul>
            <li>t_in_air (Входящая температура воздуха) = 34.8 °C</li>
            <li>t_out_air (Температура воздуха на выходе) = 53.1 °C</li>
            <li>
              G_air (Массовый расход воздуха через 2 ряд) = 28750 кг/час (при
              rho = 1.15)
            </li>
            <li>
              v_air (Массовая скорость воздуха во фронтальном сечении) = 6.33
              кг/(м²·с)
            </li>
            <li>
              Q_ср (Средняя зафиксированная мощность ряда) = 148000 Вт (148 кВт)
            </li>
            <li>
              G_w (Необходимый расход воды на калорифер) = 7500 кг/час
              (константа 1-го ряда)
            </li>
            <li>
              W_w (Скорость движения воды в трубках) = 0.739 м/сек (константа
              1-го ряда)
            </li>
            <li>K (Коэффициент теплопередачи) = 73.908 Вт/(м²·°C)</li>
            <li>
              T_in_w (Температура горячей воды на входе из сети) = 95.0 °C
            </li>
            <li>
              T_out_w (Температура обратной воды на выходе из ряда) = 78.1 °C
            </li>
            <li>dT_М (Меньшая дельта температур) = 95.0 - 53.1 = 41.9 °C</li>
            <li>dT_Б (Большая дельта температур) = 78.1 - 34.8 = 43.3 °C</li>
            <li>
              dT_mean (Среднеарифметический напор сред, так как 43.3/41.9{"<"}=
              1.8) = 42.6 °С
            </li>
            <li>Delta_Pa (Аэродинамическое сопротивление) = 191 Па</li>
            <li>Delta_Pw (Гидравлическое сопротивление) = 11.0 кПа</li>
          </ul>
        </div>

        <div>
          <p>
            КАЛОРИФЕР КФБ-12 А3 М ТРЕТЬЕГО РЯДА. ПЕРЕКРЕСТНОТОЧНАЯ СХЕМА. РЕЖИМ
            95/70°С. НАГРЕВ ВОЗДУХА ОТ 51°C ДО 61°C
          </p>

          <ul>
            <li>t_in_air (Входящая температура воздуха) = 50.6 °C</li>
            <li>t_out_air (Температура воздуха на выходе) = 60.7 °C</li>
            <li>
              G_air (Массовый расход воздуха через 3 ряд) = 27250 кг/час (при
              rho = 1.09)
            </li>
            <li>
              v_air (Массовая скорость воздуха во фронтальном сечении) = 6.02
              кг/(м²·с)
            </li>
            <li>
              Q_ср (Средняя зафиксированная мощность ряда) = 77000 Вт (77 кВт)
            </li>
            <li>
              G_w (Необходимый расход воды на калорифер) = 2660 кг/час (0.7389
              кг/сек)
            </li>
            <li>W_w (Скорость движения воды в трубках) = 0.262 м/сек</li>
            <li>K (Коэффициент теплопередачи) = 65.306 Вт/(м²·°C)</li>
            <li>
              T_in_w (Температура горячей воды на входе из сети) = 95.0 °C
            </li>
            <li>
              T_out_w (Температура обратной воды на выходе из ряда) = 70.0 °C
            </li>
            <li>dT_Б (Большая дельта температур) = 95.0 - 60.7 = 34.3 °C</li>
            <li>dT_М (Меньшая дельта температур) = 70.0 - 50.6 = 19.4 °C</li>
            <li>
              dT_mean (Среднеарифметический напор сред, так как 34.3/19.4{"<"}
              =1.8) = 26.85 °С
            </li>
            <li>Delta_Pa (Аэродинамическое сопротивление) = 181 Па</li>
            <li>Delta_Pw (Гидравлическое сопротивление) = 1.4 кПа</li>
          </ul>
        </div>

        <div className="text-[#250e0d]">
          <p>
            КАЛОРИФЕР КФБ-12 А3 М ТРЕТЬЕГО РЯДА. ПЕРЕКРЕСТНОТОЧНАЯ СХЕМА.
            ФОРСИРОВАННЫЙ РЕЖИМ. НАГРЕВ ВОЗДУХА ОТ 53°C ДО 66°C
          </p>

          <ul>
            <li>t_in_air (Входящая температура воздуха) = 53.1 °C</li>
            <li>t_out_air (Температура воздуха на выходе) = 66.2 °C</li>
            <li>
              G_air (Массовый расход воздуха через 3 ряд) = 27125 кг/час (при
              rho = 1.085 кг/м³)
            </li>
            <li>
              v_air (Массовая скорость воздуха во фронтальном сечении) = 5.98
              кг/(м²·с)
            </li>
            <li>
              Q_ср (Средняя зафиксированная мощность ряда) = 100000 Вт (100 кВт)
            </li>
            <li>
              G_w (Необходимый расход воды на калорифер) = 7500 кг/час
              (константа 1-го ряда)
            </li>
            <li>
              W_w (Скорость движения воды в трубках) = 0.739 м/сек (константа
              1-го ряда)
            </li>
            <li>K (Коэффициент теплопередачи) = 71.742 Вт/(м²·°C)</li>
            <li>
              T_in_w (Температура горячей воды на входе из сети) = 95.0 °C
            </li>
            <li>
              T_out_w (Температура обратной воды на выходе из ряда) = 83.6 °C
            </li>
            <li>dT_М (Меньшая дельта температур) = 95.0 - 66.2 = 28.8 °C</li>
            <li>dT_Б (Большая дельта температур) = 83.6 - 53.1 = 30.5 °C</li>
            <li>
              dT_mean (Среднеарифметический напор сред, так как 30.5/28.8{"<"}
              =1.8) = 29.65 °С
            </li>
            <li>Delta_Pa (Аэродинамическое сопротивление) = 178 Па</li>
            <li>Delta_Pw (Гидравлическое сопротивление) = 11.0 кПа</li>
          </ul>
        </div>

        <div>
          <p>
            КАЛОРИФЕР КФБ-12 А3 М ЧЕТВЕРТОГО РЯДА. ПЕРЕКРЕСТНОТОЧНАЯ СХЕМА.
            РЕЖИМ 95/70°С. НАГРЕВ ВОЗДУХА ОТ 61°C ДО 67°C
          </p>

          <ul>
            <li>t_in_air (Входящая температура воздуха) = 60.7 °C</li>
            <li>
              t_out_air (Конечная температура воздуха на выходе) = 66.8 °C
            </li>
            <li>
              G_air (Массовый расход воздуха через 4 ряд) = 26500 кг/час (при
              rho = 1.06)
            </li>
            <li>
              v_air (Массовая скорость воздуха во фронтальном сечении) = 5.84
              кг/(м²·с)
            </li>
            <li>
              Q_ср (Средняя зафиксированная мощность ряда) = 45000 Вт (45.0 кВт)
            </li>
            <li>
              G_w (Необходимый расход воды на калорифер) = 1560 кг/час (0.4333
              кг/сек)
            </li>
            <li>W_w (Скорость движения воды в трубках) = 0.154 м/сек</li>
            <li>K (Коэффициент теплопередачи) = 61.119 Вт/(м²·°C)</li>
            <li>
              T_in_w (Температура горячей воды на входе из сети) = 95.0 °C
            </li>
            <li>
              T_out_w (Температура обратной воды на выходе из ряда) = 70.0 °C
            </li>
            <li>dT_Б (Большая дельта температур) = 95.0 - 66.8 = 28.2 °C</li>
            <li>dT_М (Меньшая дельта температур) = 70.0 - 60.7 = 9.3 °C</li>
            <li>
              dT_mean (Среднелогарифмический напор сред, так как 28.2/9.3=3.03
              {">"}1.8) = 17.02 °С
            </li>
            <li>Delta_Pa (Аэродинамическое сопротивление) = 171 Па</li>
            <li>Delta_Pw (Гидравлическое сопротивление) = 0.5 кПа</li>
          </ul>
        </div>

        <div className="text-[#250e0d]">
          <p>
            КАЛОРИФЕР КФБ-12 А3 М ЧЕТВЕРТОГО РЯДА. ПЕРЕКРЕСТНОТОЧНАЯ СХЕМА.
            ФОРСИРОВАННЫЙ РЕЖИМ. НАГРЕВ ВОЗДУХА ОТ 66°C ДО 75°C
          </p>

          <ul>
            <li>t_in_air (Входящая температура воздуха) = 66.2 °C</li>
            <li>
              t_out_air (Конечная температура воздуха на выходе) = 75.4 °C
            </li>
            <li>
              G_air (Массовый расход воздуха через 4 ряд) = 26000 кг/час (при
              rho = 1.04 кг/м³)
            </li>
            <li>
              v_air (Массовая скорость воздуха во фронтальном сечении) = 5.75
              кг/(м²·с)
            </li>
            <li>
              Q_ср (Средняя зафиксированная мощность ряда) = 67000 Вт (67 кВт)
            </li>
            <li>
              G_w (Необходимый расход воды на калорифер) = 7500 кг/час
              (константа 1-го ряда)
            </li>
            <li>
              W_w (Скорость движения воды в трубках) = 0.739 м/сек (константа
              1-го ряда)
            </li>
            <li>K (Коэффициент теплопередачи) = 70.301 Вт/(м²·°C)</li>
            <li>
              T_in_w (Температура горячей воды на входе из сети) = 95.0 °C
            </li>
            <li>
              T_out_w (Температура обратной воды на выходе из ряда) = 87.3 °C
            </li>
            <li>dT_М (Меньшая дельта температур) = 95.0 - 75.4 = 19.6 °C</li>
            <li>dT_Б (Большая дельта температур) = 87.3 - 66.2 = 21.1 °C</li>
            <li>
              dT_mean (Среднеарифметический напор сред, так как 21.1/19.6{"<"}
              =1.8) = 20.35 °С
            </li>
            <li>Delta_Pa (Аэродинамическое сопротивление) = 166 Па</li>
            <li>Delta_Pw (Гидравлическое сопротивление) = 10.0 кПа</li>
          </ul>
        </div>
      </div>

      <Separator className="mb-8" />

      {/* КФБ-12 А4 М */}
      <div className="space-y-2">
        <div>
          <p>
            КАЛОРИФЕР КФБ-12 А4 М ПЕРВОГО РЯДА. ПЕРЕКРЕСТНОТОЧНАЯ СХЕМА. НАГРЕВ
            ВОЗДУХА ОТ 10°C ДО 40°C
          </p>

          <ul>
            <li>t_in_air (Входящая температура воздуха) = 10.0 °C</li>
            <li>t_out_air (Температура воздуха на выходе) = 39.9 °C</li>
            <li>
              G_air (Массовый расход воздуха через установку) = 31250 кг/час
              (при rho = 1.25 кг/м³)
            </li>
            <li>
              v_air (Массовая скорость воздуха во фронтальном сечении) = 6.886
              кг/(м²·с)
            </li>
            <li>
              Q_ср (Средняя зафиксированная мощность ряда) = 263000 Вт (263 кВт)
            </li>
            <li>
              G_w (Необходимый расход воды на калорифер) = 9050 кг/час (2.5139
              кг/сек)
            </li>
            <li>W_w (Скорость движения воды в трубках) = 0.673 м/сек</li>
            <li>K (Коэффициент теплопередачи) = 74.314 Вт/(м²·°C)</li>
            <li>
              T_in_w (Температура горячей воды на входе из сети) = 95.0 °C
            </li>
            <li>
              T_out_w (Температура обратной воды на выходе из ряда) = 70.0 °C
            </li>
            <li>dT_М (Меньшая дельта температур) = 95.0 - 39.90 = 55.1 °C</li>
            <li>dT_Б (Большая дельта температур) = 70.0 - 10.0 = 60.0 °C</li>
            <li>
              dT_mean (Среднеарифметический напор сред, так как 60.0/55.1{"<"}
              =1.8) = 57.5 °С
            </li>
            <li>Delta_Pa (Аэродинамическое сопротивление) = 307 Па</li>
            <li>Delta_Pw (Гидравлическое сопротивление) = 9.1 кПа</li>
          </ul>
        </div>

        <div>
          <p>
            КАЛОРИФЕР КФБ-12 А4 М ВТОРОГО РЯДА. ПЕРЕКРЕСТНОТОЧНАЯ СХЕМА. РЕЖИМ
            95/70°С. НАГРЕВ ВОЗДУХА ОТ 40°C ДО 57°C
          </p>

          <ul>
            <li>t_in_air (Входящая температура воздуха) = 39.9 °C</li>
            <li>t_out_air (Температура воздуха на выходе) = 57.1 °C</li>
            <li>
              G_air (Массовый расход воздуха через 2 ряд) = 28250 кг/час (при
              rho = 1.13)
            </li>
            <li>
              v_air (Массовая скорость воздуха во фронтальном сечении) = 6.23
              кг/(м²·с)
            </li>
            <li>
              Q_ср (Средняя зафиксированная мощность ряда) = 137000 Вт (137 кВт)
            </li>
            <li>
              G_w (Необходимый расход воды на калорифер) = 4700 кг/час (1.3056
              кг/сек)
            </li>
            <li>W_w (Скорость движения воды в трубках) = 0.350 м/сек</li>
            <li>K (Коэффициент теплопередачи) = 67.468 Вт/(м²·°C)</li>
            <li>
              T_in_w (Температура горячей воды на входе из сети) = 95.0 °C
            </li>
            <li>
              T_out_w (Температура обратной воды на выходе из ряда) = 70.0 °C
            </li>
            <li>dT_Б (Большая дельта температур) = 95.0 - 57.1 = 37.9 °C</li>
            <li>dT_М (Меньшая дельта температур) = 70.0 - 39.9 = 30.1 °C</li>
            <li>
              dT_mean (Среднеарифметический напор сред, так как 37.9/30.1{"<"}
              =1.8) = 34.0 °С
            </li>
            <li>Delta_Pa (Аэродинамическое сопротивление) = 255 Па</li>
            <li>Delta_Pw (Гидравлическое сопротивление) = 2.5 кПа</li>
          </ul>
        </div>

        <div className="text-[#250e0d]">
          <p>
            КАЛОРИФЕР КФБ-12 А4 М ВТОРОГО РЯДА. ПЕРЕКРЕСТНОТОЧНАЯ СХЕМА.
            ФОРСИРОВАННЫЙ РЕЖИМ. НАГРЕВ ВОЗДУХА ОТ 40°C ДО 60°C
          </p>

          <ul>
            <li>t_in_air (Входящая температура воздуха) = 39.9 °C</li>
            <li>t_out_air (Температура воздуха на выходе) = 60.2 °C</li>
            <li>
              G_air (Массовый расход воздуха через 2 ряд) = 28250 кг/час (при
              rho = 1.13)
            </li>
            <li>
              v_air (Массовая скорость воздуха во фронтальном сечении) = 6.23
              кг/(м²·с)
            </li>
            <li>
              Q_ср (Средняя зафиксированная мощность ряда) = 162000 Вт (162 кВт)
            </li>
            <li>
              G_w (Необходимый расход воды на калорифер) = 9050 кг/час
              (константа 1-го ряда)
            </li>
            <li>
              W_w (Скорость движения воды в трубках) = 0.673 м/сек (константа
              1-го ряда)
            </li>
            <li>K (Коэффициент теплопередачи) = 70.546 Вт/(м²·°C)</li>
            <li>
              T_in_w (Температура горячей воды на входе из сети) = 95.0 °C
            </li>
            <li>
              T_out_w (Температура обратной воды на выходе из ряда) = 79.7 °C
            </li>
            <li>dT_М (Меньшая дельта температур) = 95.0 - 60.2 = 34.8 °C</li>
            <li>dT_Б (Большая дельта температур) = 79.7 - 39.9 = 39.8 °C</li>
            <li>
              dT_mean (Среднеарифметический напор сред, так как 39.8/34.8{"<"}=
              1.8) = 37.30 °С
            </li>
            <li>Delta_Pa (Аэродинамическое сопротивление) = 255 Па</li>
            <li>Delta_Pw (Гидравлическое сопротивление) = 9.1 кПа</li>
          </ul>
        </div>

        <div>
          <p>
            КАЛОРИФЕР КФБ-12 А4 М ТРЕТЬЕГО РЯДА. ПЕРЕКРЕСТНОТОЧНАЯ СХЕМА. РЕЖИМ
            95/70°С. НАГРЕВ ВОЗДУХА ОТ 57°C ДО 67°C
          </p>

          <ul>
            <li>t_in_air (Входящая температура воздуха) = 57.1 °C</li>
            <li>t_out_air (Температура воздуха на выходе) = 66.5 °C</li>
            <li>
              G_air (Массовый расход воздуха через 3 ряд) = 26750 кг/час (при
              rho = 1.07)
            </li>
            <li>
              v_air (Массовая скорость воздуха во фронтальном сечении) = 5.90
              кг/(м²·с)
            </li>
            <li>
              Q_ср (Средняя зафиксированная мощность ряда) = 71000 Вт (71 кВт)
            </li>
            <li>
              G_w (Необходимый расход воды на калорифер) = 2430 кг/час (0.675
              кг/сек)
            </li>
            <li>W_w (Скорость движения воды в трубках) = 0.181 м/сек</li>
            <li>K (Коэффициент теплопередачи) = 62.740 Вт/(м²·°C)</li>
            <li>
              T_in_w (Температура горячей воды на входе из сети) = 95.0 °C
            </li>
            <li>
              T_out_w (Температура обратной воды на выходе из ряда) = 70.0 °C
            </li>
            <li>dT_Б (Большая дельта температур) = 95.0 - 66.5 = 28.5 °C</li>
            <li>dT_М (Меньшая дельта температур) = 70.0 - 57.1 = 12.9 °C</li>
            <li>
              dT_mean (Среднелогарифмический напор сред, так как 28.5/12.9=2.21
              {">"}1.8) = 19.6 °С
            </li>
            <li>Delta_Pa (Аэродинамическое сопротивление) = 231 Па</li>
            <li>Delta_Pw (Гидравлическое сопротивление) = 0.7 кПа</li>
          </ul>
        </div>

        <div className="text-[#250e0d]">
          <p>
            КАЛОРИФЕР КФБ-12 А4 М ТРЕТЬЕГО РЯДА. ПЕРЕКРЕСТНОТОЧНАЯ СХЕМА.
            ФОРСИРОВАННЫЙ РЕЖИМ. НАГРЕВ ВОЗДУХА ОТ 60°C ДО 73°C
          </p>

          <ul>
            <li>t_in_air (Входящая температура воздуха) = 60.2 °C</li>
            <li>t_out_air (Температура воздуха на выходе) = 73.4 °C</li>
            <li>
              G_air (Массовый расход воздуха через 3 ряд) = 26500 кг/час (при
              rho = 1.06 кг/м³)
            </li>
            <li>
              v_air (Массовая скорость воздуха во фронтальном сечении) = 5.85
              кг/(м²·с)
            </li>
            <li>
              Q_ср (Средняя зафиксированная мощность ряда) = 99000 Вт (99 кВт)
            </li>
            <li>
              G_w (Необходимый расход воды на калорифер) = 9050 кг/час
              (константа 1-го ряда)
            </li>
            <li>
              W_w (Скорость движения воды в трубках) = 0.673 м/сек (константа
              1-го ряда)
            </li>
            <li>K (Коэффициент теплопередачи) = 68.286 Вт/(м²·°C)</li>
            <li>
              T_in_w (Температура горячей воды на входе из сети) = 95.0 °C
            </li>
            <li>
              T_out_w (Температура обратной воды на выходе из ряда) = 85.6 °C
            </li>
            <li>dT_М (Меньшая дельта температур) = 95.0 - 73.4 = 21.6 °C</li>
            <li>dT_Б (Большая дельта температур) = 85.6 - 60.2 = 25.4 °C</li>
            <li>
              dT_mean (Среднеарифметический напор сред, так как 25.4/21.6{"<"}
              =1.8) = 23.5 °С
            </li>
            <li>Delta_Pa (Аэродинамическое сопротивление) = 227 Па</li>
            <li>Delta_Pw (Гидравлическое сопротивление) = 9.1 кПа</li>
          </ul>
        </div>

        <div>
          <p>
            КАЛОРИФЕР КФБ-12 А4 М ЧЕТВЕРТОГО РЯДА. ПЕРЕКРЕСТНОТОЧНАЯ СХЕМА.
            РЕЖИМ 95/70°С. НАГРЕВ ВОЗДУХА ОТ 67°C ДО 71°C
          </p>

          <ul>
            <li>t_in_air (Входящая температура воздуха) = 66.5 °C</li>
            <li>
              t_out_air (Конечная температура воздуха на выходе) = 70.7 °C
            </li>
            <li>
              G_air (Массовый расход воздуха через 4 ряд) = 26000 кг/час (при
              rho = 1.04)
            </li>
            <li>
              v_air (Массовая скорость воздуха во фронтальном сечении) = 5.74
              кг/(м²·с)
            </li>
            <li>
              Q_ср (Средняя зафиксированная мощность ряда) = 31000 Вт (31.0 кВт)
            </li>
            <li>
              G_w (Необходимый расход воды на калорифер) = 1070 кг/час (0.2972
              кг/сек)
            </li>
            <li>W_w (Скорость движения воды в трубках) = 0.080 м/сек</li>
            <li>K (Коэффициент теплопередачи) = 58.475 Вт/(м²·°C)</li>
            <li>
              T_in_w (Температура горячей воды на входе из сети) = 95.0 °C
            </li>
            <li>
              T_out_w (Температура обратной воды на выходе из ряда) = 70.0 °C
            </li>
            <li>dT_Б (Большая дельта температур) = 95.0 - 70.7 = 24.3 °C</li>
            <li>dT_М (Меньшая дельта температур) = 70.0 - 66.5 = 3.5 °C</li>
            <li>
              dT_mean (Среднелогарифмический напор сред, так как 24.3/3.5=6.94
              {">"}1.8) = 10.74 °С
            </li>
            <li>Delta_Pa (Аэродинамическое сопротивление) = 219 Па</li>
            <li>Delta_Pw (Гидравлическое сопротивление) = 0.1 кПа</li>
          </ul>
        </div>

        <div className="text-[#250e0d]">
          <p>
            КАЛОРИФЕР КФБ-12 А4 М ЧЕТВЕРТОГО РЯДА. ПЕРЕКРЕСТНОТОЧНАЯ СХЕМА.
            ФОРСИРОВАННЫЙ РЕЖИМ. НАГРЕВ ВОЗДУХА ОТ 73°C ДО 82°C
          </p>

          <ul>
            <li>t_in_air (Входящая температура воздуха) = 73.4 °C</li>
            <li>
              t_out_air (Конечная температура воздуха на выходе) = 81.7 °C
            </li>
            <li>
              G_air (Массовый расход воздуха через 4 ряд) = 25500 кг/час (при
              rho = 1.02 кг/м³)
            </li>
            <li>
              v_air (Массовая скорость воздуха во фронтальном сечении) = 5.63
              кг/(м²·с)
            </li>
            <li>
              Q_ср (Средняя зафиксированная мощность ряда) = 60000 Вт (60 кВт)
            </li>
            <li>
              G_w (Необходимый расход воды на калорифер) = 9050 кг/час
              (константа 1-го ряда)
            </li>
            <li>
              W_w (Скорость движения воды в трубках) = 0.673 м/сек (константа
              1-го ряда)
            </li>
            <li>K (Коэффициент теплопередачи) = 66.926 Вт/(м²·°C)</li>
            <li>
              T_in_w (Температура горячей воды на входе из сети) = 95.0 °C
            </li>
            <li>
              T_out_w (Температура обратной воды на выходе из ряда) = 89.3 °C
            </li>
            <li>dT_М (Меньшая дельта температур) = 95.0 - 81.7 = 13.3 °C</li>
            <li>dT_Б (Большая дельта температур) = 89.3 - 73.4 = 15.9 °C</li>
            <li>
              dT_mean (Среднеарифметический напор сред, так как 15.9/13.3{"<"}
              =1.8) = 14.6 °С
            </li>
            <li>Delta_Pa (Аэродинамическое сопротивление) = 211 Па</li>
            <li>Delta_Pw (Гидравлическое сопротивление) = 9.1 кПа</li>
          </ul>
        </div>
      </div>
    </>
  );
}

/* Формулы расчета перекрестного тока */
function CrossFlowFormulas() {
  return (
    <>
      <Heading
        lvl={4}
        text="Инженерная методика: расчёт 4-х рядного блока перекрестного тока по методу NTU"
        className="text-black"
      />

      <p>
        Метод NTU/КПД позволяет рассчитать общую мощность и конечные
        температурные параметры многорядного блока без применения итерационных
        циклов определения промежуточных характеристик сред. Расчет выполняется
        последовательно: от массовых расходов и конструктивной геометрии
        оборудования к финальным температурным показателям. Ниже приведена
        базовая инженерная схема расчета для 4-х рядных блоков КФБ-12 А3 М и
        КФБ-12 А4 М в режиме параллельно-перекрестного тока.
      </p>

      <ol className="space-y-4">
        <li>
          <p>
            Шаг 1. Тепловая способность воздушного и водяного потоков (W, Вт/°C)
          </p>
          <p>
            Определяет количество тепловой энергии, необходимое для изменения
            температуры потока среды на 1 °C:
          </p>
          <ul>
            <li>• Воздушный поток: W_возд = (G_air / 3600) * 1006</li>
            <li>• Водяной поток: W_воды = (G_w_transit / 3600) * 4187</li>
          </ul>
          <p>
            Для проведения расчета выбирается наименьшее значение: W_min =
            W_возд. На основании полученных величин вычисляется безразмерное
            отношение потоков: W_o = W_min / W_воды.
          </p>
        </li>

        <li>
          <p>Шаг 2. Тепловой потенциал трубного пучка (NTU_block)</p>
          <p>
            Характеризует безразмерную тепловую способность всей площади
            поверхности нагрева установки относительно массового расхода
            воздуха:
          </p>
          <ul>
            <li>• NTU_block = (K_average * F_общ) / W_min</li>
          </ul>
          <p>
            Где: F_общ — суммарная площадь поверхности теплообмена всех четырех
            калориферов блока, м²; K_average — средний коэффициент теплопередачи
            оборудования, Вт/(м²·°C).
          </p>
        </li>

        <li>
          <p>Шаг 3. Итоговый тепловой КПД установки (E_block)</p>
          <p>
            Для перекрестноточной схемы обвязки общая эффективность теплообмена
            неперемешивающихся сред вычисляется по интегральной зависимости
            Кэйса-Босмана:
          </p>
          <ul>
            <li>
              • E_block = 1 - exp((NTU_block^0.22 / W_o) * (exp(-W_o *
              NTU_block^0.78) - 1))
            </li>
          </ul>
        </li>

        <li>
          <p>Шаг 4. Расчет финальных паспортных параметров</p>
          <ul>
            <li>
              • Общая тепловая мощность блока: Q = W_min * E_block * (T_вх_воды
              - t_вх_возд)
            </li>
            <li>
              • Температура воздуха на выходе: t_out_air = t_вх_возд + Q /
              W_возд
            </li>
            <li>
              • Температура обратной воды: T_out_w = T_вх_воды - Q / W_воды
            </li>
          </ul>
        </li>
      </ol>
    </>
  );
}

/* Интегральный расчет по методу NTU - 1 */
function NTUIntegralCalculation1() {
  return (
    <>
      {/* КФБ-12 А3 М */}
      <div className="mb-8 space-y-2">
        <div>
          <p>
            АЛЬТЕРНАТИВНЫЙ РАСЧЕТ БЛОКА КФБ-12 А3 М ПО МЕТОДУ NTU/КПД.
            ПЕРЕКРЕСТНОТОЧНАЯ СХЕМА. РЕЖИМ 95/70°С. НАГРЕВ ВОЗДУХА ОТ 10°C ДО
            69°C
          </p>

          <ul>
            <li>t_in_air (Входящая температура воздуха) = 10.0 °C</li>
            <li>
              t_out_air (Итоговая температура воздуха на выходе из блока) = 68.5
              °C
            </li>
            <li>
              G_air (Массовый расход воздуха через установку) = 31250 кг/час
              (при rho = 1.25 кг/м³)
            </li>
            <li>
              v_air (Массовая скорость воздуха во фронтальном сечении) = 6.886
              кг/(м²·с)
            </li>
            <li>
              Q_block_total (Общая тепловая мощность 4-рядного блока) = 514000
              Вт (514 кВт)
            </li>
            <li>
              G_w_transit (Суммарный расход воды на весь 4-рядный блок) = 17700
              кг/час
            </li>
            <li>
              W_w_tubes (Средняя скорость движения воды в трубках рядов) = 0.436
              м/сек
            </li>
            <li>
              K_average (Средний коэффициент теплопередачи калориферов) = 73.422
              Вт/(м²·°C)
            </li>
            <li>
              T_in_w (Температура горячей воды на входе в блок из сети) = 95.0
              °C
            </li>
            <li>
              T_out_w (Итоговая температура обратной воды, возвращаемой в сеть)
              = 70.0 °C
            </li>
            <li>
              NTU_block (Общее число единиц переноса тепла установки) = 1.6063
            </li>
            <li>
              E_block (Общий тепловой КПД / эффективность перекрестноточного
              блока) = 0.688 (68.8%)
            </li>
            <li>
              Delta_Pa_total (Суммарное аэродинамическое сопротивление блока) =
              929 Па
            </li>
            <li>
              Delta_Pw_total (Гидравлическое сопротивление блока) = 3.8 кПа
            </li>
          </ul>
        </div>

        <div className="text-[#250e0d]">
          <p>
            АЛЬТЕРНАТИВНЫЙ РАСЧЕТ БЛОКА КФБ-12 А3 М ПО МЕТОДУ NTU/КПД.
            ПЕРЕКРЕСТНОТОЧНАЯ СХЕМА. ФОРСИРОВАННЫЙ РЕЖИМ. НАГРЕВ ВОЗДУХА ОТ 10°C
            ДО 74°C
          </p>

          <ul>
            <li>t_in_air (Входящая температура воздуха) = 10.0 °C</li>
            <li>
              t_out_air (Итоговая температура воздуха на выходе из блока) = 73.6
              °C
            </li>
            <li>
              G_air (Массовый расход воздуха через установку) = 31250 кг/час
              (при rho = 1.25 кг/м³)
            </li>
            <li>
              v_air (Массовая скорость воздуха во фронтальном сечении) = 6.886
              кг/(м²·с)
            </li>
            <li>
              Q_block_total (Общая тепловая мощность 4-рядного блока) = 559000
              Вт (559 кВт)
            </li>
            <li>
              G_w_transit (Суммарный расход воды на весь 4-рядный блок) = 30000
              кг/час (4 ряда по 7500 кг/ч)
            </li>
            <li>
              W_w_tubes (Скорость движения воды в трубках) = 0.739 м/сек
              (константа 1-го ряда)
            </li>
            <li>
              K_average (Средний коэффициент теплопередачи калориферов) = 77.175
              Вт/(м²·°C)
            </li>
            <li>
              T_in_w (Температура горячей воды на входе в блок из сети) = 95.0
              °C
            </li>
            <li>
              T_out_w (Средневзвешенная температура обратной воды, возвращаемой
              в сеть) = 79.0 °C
            </li>
            <li>
              NTU_block (Общее число единиц переноса тепла установки) = 1.6904
            </li>
            <li>
              E_block (Общий тепловой КПД / эффективность перекрестноточного
              блока) = 0.748 (74.8%)
            </li>
            <li>
              Delta_Pa_total (Суммарное аэродинамическое сопротивление блока) =
              929 Па
            </li>
            <li>
              Delta_Pw_total (Гидравлическое сопротивление блока) = 11.0 кПа
            </li>
          </ul>
        </div>
      </div>

      <Separator className="mb-8" />

      {/* КФБ-12 А4 М */}
      <div className="space-y-2">
        <div>
          <p>
            АЛЬТЕРНАТИВНЫЙ РАСЧЕТ БЛОКА КФБ-12 А4 М ПО МЕТОДУ NTU/КПД.
            ПЕРЕКРЕСТНОТОЧНАЯ СХЕМА. РЕЖИМ 95/70°С. НАГРЕВ ВОЗДУХА ОТ 10°C ДО
            75°C
          </p>

          <ul>
            <li>t_in_air (Входящая температура воздуха) = 10.0 °C</li>
            <li>
              t_out_air (Итоговая температура воздуха на выходе из блока) = 74.5
              °C
            </li>
            <li>
              G_air (Массовый расход воздуха через установку) = 31250 кг/час
              (при rho = 1.25 кг/м³)
            </li>
            <li>
              v_air (Массовая скорость воздуха во фронтальном сечении) = 6.886
              кг/(м²·с)
            </li>
            <li>
              Q_block_total (Общая тепловая мощность 4-рядного блока) = 567000
              Вт (567 кВт)
            </li>
            <li>
              G_w_transit (Суммарный расход воды на весь 4-рядный блок) = 19500
              кг/час
            </li>
            <li>
              W_w_tubes (Средняя скорость движения воды в трубках рядов) = 0.363
              м/сек
            </li>
            <li>
              K_average (Средний коэффициент теплопередачи калориферов) = 71.248
              Вт/(м²·°C)
            </li>
            <li>
              T_in_w (Температура горячей воды на входе в блок из сети) = 95.0
              °C
            </li>
            <li>
              T_out_w (Итоговая температура обратной воды, возвращаемой в сеть)
              = 70.0 °C
            </li>
            <li>
              NTU_block (Общее число единиц переноса тепла установки) = 2.0611
            </li>
            <li>
              E_block (Общий тепловой КПД / эффективность перекрестноточного
              блока) = 0.759 (75.9%)
            </li>
            <li>
              Delta_Pa_total (Суммарное аэродинамическое сопротивление блока) =
              1226 Па
            </li>
            <li>
              Delta_Pw_total (Гидравлическое сопротивление блока) = 2.6 кПа
            </li>
          </ul>
        </div>

        <div className="text-[#250e0d]">
          <p>
            АЛЬТЕРНАТИВНЫЙ РАСЧЕТ БЛОКА КФБ-12 А4 М ПО МЕТОДУ NTU/КПД.
            ПЕРЕКРЕСТНОТОЧНАЯ СХЕМА. ФОРСИРОВАННЫЙ РЕЖИМ. НАГРЕВ ВОЗДУХА ОТ 10°C
            ДО 80°C
          </p>

          <ul>
            <li>t_in_air (Входящая температура воздуха) = 10.0 °C</li>
            <li>
              t_out_air (Итоговая температура воздуха на выходе из блока) = 80.0
              °C
            </li>
            <li>
              G_air (Массовый расход воздуха через установку) = 31250 кг/час
              (при rho = 1.25 кг/м³)
            </li>
            <li>
              v_air (Массовая скорость воздуха во фронтальном сечении) = 6.886
              кг/(м²·с)
            </li>
            <li>
              Q_block_total (Общая тепловая мощность 4-рядного блока) = 615000
              Вт (615 кВт)
            </li>
            <li>
              G_w_transit (Суммарный расход воды на весь 4-рядный блок) = 36200
              кг/час (4 ряда по 9050 кг/ч)
            </li>
            <li>
              W_w_tubes (Скорость движения воды в трубках) = 0.673 м/сек
              (константа 1-го ряда)
            </li>
            <li>
              K_average (Средний коэффициент теплопередачи калориферов) = 74.314
              Вт/(м²·°C)
            </li>
            <li>
              T_in_w (Температура горячей воды на входе в блок из сети) = 95.0
              °C
            </li>
            <li>
              T_out_w (Средневзвешенная температура обратной воды, возвращаемой
              в сеть) = 80.4 °C
            </li>
            <li>
              NTU_block (Общее число единиц переноса тепла установки) = 2.1543
            </li>
            <li>
              E_block (Общий тепловой КПД / эффективность перекрестноточного
              блока) = 0.824 (82.4%)
            </li>
            <li>
              Delta_Pa_total (Суммарное аэродинамическое сопротивление блока) =
              1226 Па
            </li>
            <li>
              Delta_Pw_total (Гидравлическое сопротивление блока) = 9.1 кПа
            </li>
          </ul>
        </div>
      </div>
    </>
  );
}

/* Сравнительный анализ методов расчета */
function CalculationMethodsComparison() {
  return (
    <>
      <div className="space-y-2">
        <p>
          Сопоставление двух математических моделей в условиях
          параллельно-перекрестного тока выявляет их принципиальные физические и
          алгоритмические различия:
        </p>

        <ul className="space-y-2">
          <li>
            <span className="text-example">• Порядный расчет:</span>{" "}
            Рассматривает блок как цепочку изолированных ступеней по воздуху.
            Метод оптимален для моделирования обычного (балансового) режима, так
            как позволяет задавать жесткие условия по обратке для каждого ряда
            индивидуально и вычислять точечное зажатие локального расхода
            автоматикой. Однако при фиксации сквозного транзитного расхода
            (форсированный режим) этот метод приводит к математическим невязкам
            на конечных ступенях.
          </li>
          <li>
            <span className="text-example">
              • Интегральный расчет (метод NTU/КПД):
            </span>{" "}
            Оценивает блок как единый монолитный теплообменный массив. Метод без
            итерационных циклов рассчитывает форсированный режим, где расходы
            воды по рядам равны по умолчанию. При моделировании обычного режима
            интегральный метод NTU требует закладывать общий расход
            теплоносителя на 9–11% выше, чем сумма порядных расходов. Это
            обусловлено тем, что NTU учитывает реальное физическое смешение
            потоков в общем выходном коллекторе (где первый ряд выдает глубоко
            остывшую воду, а четвертый — перегретую), в то время как порядный
            расчет моделирует идеализированную пошаговую балансировку контуров.
          </li>
        </ul>
      </div>

      <div className="space-y-2">
        <p>Причины расхождения результатов и точность данных:</p>

        <ol className="space-y-2">
          <li>
            <span className="text-example">1. Массовый расход воздуха:</span> В
            методе NTU массовый расход воздуха зафиксирован как константа (31
            250 кг/ч) для всех рядов. Порядный же расчет считает каждый ряд
            индивидуально, привязываясь к базовому объемному расходу и падающей
            локальной плотности нагретого воздуха. Это приводит к
            последовательному снижению расчетной массы на конечных рядах (до 26
            500–26 000 кг/ч) и занижению итоговой мощности блока на 5–13% по
            сравнению с NTU.
          </li>
          <li>
            <span className="text-example">
              2. Аэродинамическое сопротивление:
            </span>{" "}
            В порядном расчете суммарное сопротивление блоков составило 767–783
            Па (А3 М) и 1000–1012 Па (А4 М), а метод NTU выдал фиксированные 929
            Па и 1226 Па соответственно. Метод NTU ведет расчет аэродинамики
            исходя из полной массы проходящего воздуха на всех ступенях. Для
            подбора вентиляционного оборудования за основу рекомендуется брать
            показатели метода NTU, чтобы исключить риск падения системы по
            объемной производительности.
          </li>
          <li>
            <span className="text-example">3. Оценка локальных зон риска:</span>{" "}
            В порядном расчете коэффициент теплопередачи конечных рядов падает
            до минимальных значений (58.4...61.1 Вт/(м²·°C)) из-за
            искусственного зажимания расхода и падения скорости воды до
            ламинарных 0.08 м/с. В методе NTU средний коэффициент блока
            удерживается на стабильном уровне 71.2...73.4 Вт/(м²·°C). Порядный
            метод в данном случае выступает незаменимым инструментом локальной
            диагностики, наглядно показывая инженеру зоны гидравлического застоя
            и риска завоздушивания.
          </li>
        </ol>

        <p>
          <span className="text-example">Резюме:</span> Порядный расчет служит
          инструментом локальной диагностики рядов для настройки балансировочной
          арматуры и дает проектировщику необходимый тепловой запас по воздуху.
          Интегральный метод NTU выступает как поверочный инструмент для всей
          установки в целом, выдавая наиболее точные и предельные показатели для
          окончательного подбора высоконапорного вентилятора и насосных групп.
        </p>
      </div>
    </>
  );
}

/* Формулы расчета прямотока */
function ParallelFlowFormulas() {
  return (
    <>
      {/* Инженерная методика: расчет 4-х рядного блока прямотока по методу NTU */}
      <Heading
        lvl={4}
        text="Инженерная методика: расчет 4-х рядного блока прямотока по методу NTU"
        className="text-black"
      />

      <p>
        Метод NTU/КПД позволяет рассчитать общую мощность и конечные
        температурные параметры многорядного блока без применения итерационных
        циклов определения промежуточных характеристик сред. Расчет выполняется
        последовательно: от массовых расходов и конструктивной геометрии
        оборудования к финальным температурным показателям. Ниже приведена
        базовая инженерная схема расчета для 4-х рядных блоков КФБ-12 А3 М и
        КФБ-12 А4 М в режиме последовательного прямотока.
      </p>

      <ol className="space-y-4">
        <li>
          <p>
            Шаг 1. Тепловая способность воздушного и водяного потоков (W, Вт/°C)
          </p>
          <p>
            Определяет количество тепловой энергии, необходимое для изменения
            температуры потока среды на 1 °C:
          </p>
          <ul>
            <li>• Воздушный поток: W_возд = (G_air / 3600) * 1006</li>
            <li>• Водяной поток: W_воды = (G_w_transit / 3600) * 4187</li>
          </ul>
          <p>
            Для проведения расчёта выбирается наименьшее значение: W_min =
            W_возд. На основании полученных величин вычисляется безразмерное
            отношение потоков: W_o = W_min / W_воды.
          </p>
        </li>

        <li>
          <p>Шаг 2. Тепловой потенциал трубного пучка (NTU_block)</p>
          <p>
            Характеризует безразмерную тепловую способность всей площади
            поверхности нагрева установки относительно массового расхода
            воздуха:
          </p>
          <ul>
            <li>• NTU_block = (K_average * F_общ) / W_min</li>
          </ul>
          <p>
            Где: F_общ — суммарная площадь поверхности теплообмена всех четырех
            калориферов блока, м²; K_average — средний коэффициент теплопередачи
            оборудования, Вт/(м²·°C).
          </p>
        </li>

        <li>
          <p>Шаг 3. Итоговый тепловой КПД установки (E_block)</p>
          <p>
            Для схемы чистого последовательного прямотока общая эффективность
            теплообмена неперемешивающихся сред вычисляется по интегральной
            зависимости Кэйса-Босмана:
          </p>
          <ul>
            <li>• E_block = (1 – exp (-NTU_block * (1 + W_o))) / (1 + W_o)</li>
          </ul>
        </li>

        <li>
          <p>Шаг 4. Расчет финальных паспортных параметров</p>
          <ul>
            <li>
              • Общая тепловая мощность блока: Q = W_min * E_block * (T_вх_воды
              - t_вх_возд)
            </li>
            <li>
              • Температура воздуха на выходе: t_out_air = t_вх_возд + Q /
              W_возд
            </li>
            <li>
              • Температура обратной воды: T_out_w = T_вх_воды - Q / W_воды
            </li>
          </ul>
        </li>
      </ol>
    </>
  );
}

/* Интегральный расчет по методу NTU - 2 */
function NTUIntegralCalculation2() {
  return (
    <>
      {/* КФБ-12 А3 М */}
      <div className="mb-8 space-y-2">
        <div>
          <p>
            РАСЧЕТ ОДИНОЧНОГО КАЛОРИФЕРА (1-Я СТУПЕНЬ НАГРЕВА) КФБ-12 А3 М.
            ПРЯМОТОЧНАЯ СХЕМА. НАГРЕВ ВОЗДУХА ОТ 10°C ДО 36°C
          </p>

          <ul>
            <li>t_in_air (Входящая температура воздуха) = 10.0 °C</li>
            <li>
              t_out_air (Температура воздуха на выходе из блока) = 36.4 °C
            </li>
            <li>
              G_air (Массовый расход воздуха через установку) = 31250 кг/час
              (при rho = 1.25 кг/м³)
            </li>
            <li>
              v_air (Массовая скорость воздуха во фронтальном сечении) = 6.886
              кг/(м²·с)
            </li>
            <li>
              Q_block_total (Тепловая мощность 1-рядного блока) = 232000 Вт (232
              кВт)
            </li>
            <li>G_w_transit (Расход воды на 1-рядный блок) = 10150 кг/час</li>
            <li>
              W_w_tubes (Скорость движения воды в трубках) = 1.000 м/сек
              (жесткая константа)
            </li>
            <li>
              K_average (Коэффициент теплопередачи калорифера) = 79.414
              Вт/(м²·°C)
            </li>
            <li>
              T_in_w (Температура горячей воды на входе в блок из сети) = 95.0
              °C
            </li>
            <li>
              T_out_w (Температура обратной воды на выходе из блока) = 75.3 °C
            </li>
            <li>
              NTU_block (Число единиц переноса тепла установки из 1-го ряда) =
              0.3573
            </li>
            <li>
              E_block (Тепловой КПД / эффективность 1-рядного прямоточного
              блока) = 0.311 (31.1%)
            </li>
            <li>
              Delta_Pa_total (Аэродинамическое сопротивление блока) = 232 Па
            </li>
            <li>
              Delta_Pw_total (Гидравлическое сопротивление блока) = 20.157 кПа
            </li>
          </ul>
        </div>

        <div>
          <p>
            РАСЧЕТ 2-Х РЯДНОГО БЛОКА КФБ-12 А3 М ПО МЕТОДУ NTU/КПД. ПРЯМОТОЧНАЯ
            СХЕМА. НАГРЕВ ВОЗДУХА ОТ 10°C ДО 48°C
          </p>

          <ul>
            <li>t_in_air (Входящая температура воздуха) = 10.0 °C</li>
            <li>
              t_out_air (Температура воздуха на выходе из блока) = 48.1 °C
            </li>
            <li>
              G_air (Массовый расход воздуха через установку) = 31250 кг/час
              (при rho = 1.25 кг/м³)
            </li>
            <li>
              v_air (Массовая скорость воздуха во фронтальном сечении) = 6.886
              кг/(м²·с)
            </li>
            <li>
              Q_block_total (Общая тепловая мощность 2-рядного блока) = 334000
              Вт (334 кВт)
            </li>
            <li>G_w_transit (Расход воды на 2-рядный блок) = 10150 кг/час</li>
            <li>
              W_w_tubes (Скорость движения воды в трубках) = 1.000 м/сек
              (жесткая константа)
            </li>
            <li>
              K_average (Средний коэффициент теплопередачи калориферов) = 79.414
              Вт/(м²·°C)
            </li>
            <li>
              T_in_w (Температура горячей воды на входе в блок из сети) = 95.0
              °C
            </li>
            <li>
              T_out_w (Температура обратной воды на выходе из блока) = 66.7 °C
            </li>
            <li>
              NTU_block (Общее число единиц переноса тепла установки из 2-х
              рядов) = 0.8687
            </li>
            <li>
              E_block (Общий тепловой КПД / эффективность 2-рядного прямоточного
              блока) = 0.448 (44.8%)
            </li>
            <li>
              Delta_Pa_total (Суммарное аэродинамическое сопротивление блока) =
              465 Па
            </li>
            <li>
              Delta_Pw_total (Суммарное гидравлическое сопротивление блока) =
              40.313 кПа
            </li>
          </ul>
        </div>

        <div>
          <p>
            РАСЧЕТ 3-Х РЯДНОГО БЛОКА КФБ-12 А3 М ПО МЕТОДУ NTU/КПД. ПРЯМОТОЧНАЯ
            СХЕМА. НАГРЕВ ВОЗДУХА ОТ 10°C ДО 54°C
          </p>

          <ul>
            <li>t_in_air (Входящая температура воздуха) = 10.0 °C</li>
            <li>
              t_out_air (Температура воздуха на выходе из блока) = 53.8 °C
            </li>
            <li>
              G_air (Массовый расход воздуха через установку) = 31250 кг/час
              (при rho = 1.25 кг/м³)
            </li>
            <li>
              v_air (Массовая скорость воздуха во фронтальном сечении) = 6.886
              кг/(м²·с)
            </li>
            <li>
              Q_block_total (Общая тепловая мощность 3-рядного блока) = 384000
              Вт (384 кВт)
            </li>
            <li>G_w_transit (Расход воды на 3-рядный блок) = 10150 кг/час</li>
            <li>
              W_w_tubes (Скорость движения воды в трубках) = 1.000 м/сек
              (жесткая константа)
            </li>
            <li>
              K_average (Средний коэффициент теплопередачи калориферов) = 79.414
              Вт/(м²·°C)
            </li>
            <li>
              T_in_w (Температура горячей воды на входе в блок из сети) = 95.0
              °C
            </li>
            <li>
              T_out_w (Температура обратной воды на выходе из блока) = 62.4 °C
            </li>
            <li>
              NTU_block (Общее число единиц переноса тепла установки из 3-х
              рядов) = 1.2531
            </li>
            <li>
              E_block (Общий тепловой КПД / эффективность 3-рядного прямоточного
              блока) = 0.515 (51.5%)
            </li>
            <li>
              Delta_Pa_total (Суммарное аэродинамическое сопротивление блока) =
              697 Па
            </li>
            <li>
              Delta_Pw_total (Суммарное гидравлическое сопротивление блока) =
              60.470 кПа
            </li>
          </ul>
        </div>

        <div>
          <p>
            РАСЧЕТ 4-Х РЯДНОГО БЛОКА КФБ-12 А3 М ПО МЕТОДУ NTU/КПД. ПРЯМОТОЧНАЯ
            СХЕМА. НАГРЕВ ВОЗДУХА ОТ 10°C ДО 56°C
          </p>

          <ul>
            <li>t_in_air (Входящая температура воздуха) = 10.0 °C</li>
            <li>
              t_out_air (Итоговая температура воздуха на выходе из блока) = 56.4
              °C
            </li>
            <li>
              G_air (Массовый расход воздуха через установку) = 31250 кг/час
              (при rho = 1.25 кг/м³)
            </li>
            <li>
              v_air (Массовая скорость воздуха во фронтальном сечении) = 6.886
              кг/(м²·с)
            </li>
            <li>
              Q_block_total (Общая тепловая мощность 4-рядного блока) = 408000
              Вт (408 кВт)
            </li>
            <li>G_w_transit (Расход воды на 4-рядный блок) = 10150 кг/час</li>
            <li>
              W_w_tubes (Скорость движения воды в трубках) = 1.000 м/сек
              (жесткая константа)
            </li>
            <li>
              K_average (Средний коэффициент теплопередачи калориферов) = 79.414
              Вт/(м²·°C)
            </li>
            <li>
              T_in_w (Температура горячей воды на входе в блок из сети) = 95.0
              °C
            </li>
            <li>
              T_out_w (Итоговая температура обратной воды на выходе из блока) =
              60.5 °C
            </li>
            <li>
              NTU_block (Общее число единиц переноса тепла установки из 4-х
              рядов) = 1.6372
            </li>
            <li>
              E_block (Общий тепловой КПД / эффективность 4-рядного прямоточного
              блока) = 0.546 (54.6%)
            </li>
            <li>
              Delta_Pa_total (Суммарное аэродинамическое сопротивление блока) =
              929 Па
            </li>
            <li>
              Delta_Pw_total (Суммарное гидравлическое сопротивление блока) =
              80.626 кПа
            </li>
          </ul>
        </div>
      </div>

      <Separator className="mb-8" />

      {/* КФБ-12 А4 М */}
      <div className="space-y-2">
        <div>
          <p>
            РАСЧЕТ ОДИНОЧНОГО КАЛОРИФЕРА (1-Я СТУПЕНЬ НАГРЕВА) КФБ-12 А4 М.
            ПРЯМОТОЧНАЯ СХЕМА. НАГРЕВ ВОЗДУХА ОТ 10°C ДО 42°C
          </p>

          <ul>
            <li>t_in_air (Входящая температура воздуха) = 10.0 °C</li>
            <li>
              t_out_air (Температура воздуха на выходе из блока) = 42.2 °C
            </li>
            <li>
              G_air (Массовый расход воздуха через установку) = 31250 кг/час
              (при rho = 1.25 кг/м³)
            </li>
            <li>
              v_air (Массовая скорость воздуха во фронтальном сечении) = 6.886
              кг/(м²·с)
            </li>
            <li>
              Q_block_total (Тепловая мощность 1-рядного блока) = 283000 Вт (283
              кВт)
            </li>
            <li>G_w_transit (Расход воды на 1-рядный блок) = 13440 кг/час</li>
            <li>
              W_w_tubes (Скорость движения воды в трубках) = 1.000 м/сек
              (жесткая константа)
            </li>
            <li>
              K_average (Коэффициент теплопередачи калорифера) = 76.342
              Вт/(м²·°C)
            </li>
            <li>
              T_in_w (Температура горячей воды на входе в блок из сети) = 95.0
              °C
            </li>
            <li>
              T_out_w (Температура обратной воды на выходе из блока) = 76.9 °C
            </li>
            <li>
              NTU_block (Число единиц переноса тепла установки из 1-го ряда) =
              0.5731
            </li>
            <li>
              E_block (Тепловой КПД / эффективность 1-рядного прямоточного
              блока) = 0.379 (37.9%)
            </li>
            <li>
              Delta_Pa_total (Аэродинамическое сопротивление блока) = 307 Па
            </li>
            <li>
              Delta_Pw_total (Гидравлическое сопротивление блока) = 20.024 кПа
            </li>
          </ul>
        </div>

        <div>
          <p>
            РАСЧЕТ 2-Х РЯДНОГО БЛОКА КФБ-12 А4 М ПО МЕТОДУ NTU/КПД. ПРЯМОТОЧНАЯ
            СХЕМА. НАГРЕВ ВОЗДУХА ОТ 10°C ДО 55°C
          </p>

          <ul>
            <li>t_in_air (Входящая температура воздуха) = 10.0 °C</li>
            <li>
              t_out_air (Температура воздуха на выходе из блока) = 54.8 °C
            </li>
            <li>
              G_air (Массовый расход воздуха через установку) = 31250 кг/час
              (при rho = 1.25 кг/м³)
            </li>
            <li>
              v_air (Массовая скорость воздуха во фронтальном сечении) = 6.886
              кг/(м²·с)
            </li>
            <li>
              Q_block_total (Общая тепловая мощность 2-рядного блока) = 393000
              Вт (393 кВт)
            </li>
            <li>G_w_transit (Расход воды на 2-рядный блок) = 13440 кг/час</li>
            <li>
              W_w_tubes (Скорость движения воды в трубках) = 1.000 м/сек
              (жесткая константа)
            </li>
            <li>
              K_average (Средний коэффициент теплопередачи калориферов) = 76.342
              Вт/(м²·°C)
            </li>
            <li>
              T_in_w (Температура горячей воды на входе в блок из сети) = 95.0
              °C
            </li>
            <li>
              T_out_w (Температура обратной воды на выходе из блока) = 69.8 °C
            </li>
            <li>
              NTU_block (Общее число единиц переноса тепла установки из 2-х
              рядов) = 1.1052
            </li>
            <li>
              E_block (Общий тепловой КПД / эффективность 2-рядного прямоточного
              блока) = 0.527 (52.7%)
            </li>
            <li>
              Delta_Pa_total (Суммарное аэродинамическое сопротивление блока) =
              613 Па
            </li>
            <li>
              Delta_Pw_total (Суммарное гидравлическое сопротивление блока) =
              40.047 кПа
            </li>
          </ul>
        </div>

        <div>
          <p>
            РАСЧЕТ 3-Х РЯДНОГО БЛОКА КФБ-12 А4 М ПО МЕТОДУ NTU/КПД. ПРЯМОТОЧНАЯ
            СХЕМА. НАГРЕВ ВОЗДУХА ОТ 10°C ДО 60°C
          </p>

          <ul>
            <li>t_in_air (Входящая температура воздуха) = 10.0 °C</li>
            <li>
              t_out_air (Температура воздуха на выходе из блока) = 60.4 °C
            </li>
            <li>
              G_air (Массовый расход воздуха через установку) = 31250 кг/час
              (при rho = 1.25 кг/м³)
            </li>
            <li>
              v_air (Массовая скорость воздуха во фронтальном сечении) = 6.886
              кг/(м²·с)
            </li>
            <li>
              Q_block_total (Общая тепловая мощность 3-рядного блока) = 442000
              Вт (442 кВт)
            </li>
            <li>G_w_transit (Расход воды на 3-рядный блок) = 13440 кг/час</li>
            <li>
              W_w_tubes (Скорость движения воды в трубках) = 1.000 м/сек
              (жесткая константа)
            </li>
            <li>
              K_average (Средний коэффициент теплопередачи калориферов) = 76.342
              Вт/(м²·°C)
            </li>
            <li>
              T_in_w (Температура горячей воды на входе в блок из сети) = 95.0
              °C
            </li>
            <li>
              T_out_w (Температура обратной воды на выходе из блока) = 66.7 °C
            </li>
            <li>
              NTU_block (Общее число единиц переноса тепла установки из 3-х
              рядов) = 1.6425
            </li>
            <li>
              E_block (Общий тепловой КПД / эффективность 3-рядного прямоточного
              блока) = 0.592 (59.2%)
            </li>
            <li>
              Delta_Pa_total (Суммарное аэродинамическое сопротивление блока) =
              920 Па
            </li>
            <li>
              Delta_Pw_total (Суммарное гидравлическое сопротивление блока) =
              60.071 кПа
            </li>
          </ul>
        </div>

        <div>
          <p>
            РАСЧЕТ 4-Х РЯДНОГО БЛОКА КФБ-12 А4 М ПО МЕТОДУ NTU/КПД. ПРЯМОТОЧНАЯ
            СХЕМА. НАГРЕВ ВОЗДУХА ОТ 10°C ДО 63°C
          </p>

          <ul>
            <li>t_in_air (Входящая температура воздуха) = 10.0 °C</li>
            <li>
              t_out_air (Итоговая температура воздуха на выходе из блока) = 62.7
              °C
            </li>
            <li>
              G_air (Массовый расход воздуха через установку) = 31250 кг/час
              (при rho = 1.25 кг/м³)
            </li>
            <li>
              v_air (Массовая скорость воздуха во фронтальном сечении) = 6.886
              кг/(м²·с)
            </li>
            <li>
              Q_block_total (Общая тепловая мощность 4-рядного блока) = 463000
              Вт (463 кВт)
            </li>
            <li>G_w_transit (Расход воды на 4-рядный блок) = 13440 кг/час</li>
            <li>
              W_w_tubes (Скорость движения воды в трубках) = 1.000 м/сек
              (жесткая константа)
            </li>
            <li>
              K_average (Средний коэффициент теплопередачи калориферов) = 76.342
              Вт/(м²·°C)
            </li>
            <li>
              T_in_w (Температура горячей воды на входе в блок из сети) = 95.0
              °C
            </li>
            <li>
              T_out_w (Температура обратной воды на выходе из блока) = 65.4 °C
            </li>
            <li>
              NTU_block (Общее число единиц переноса тепла установки из 4-х
              рядов) = 2.1757
            </li>
            <li>
              E_block (Общий тепловой КПД / эффективность 4-рядного прямоточного
              блока) = 0.62 (62.0%)
            </li>
            <li>
              Delta_Pa_total (Суммарное аэродинамическое сопротивление блока) =
              1226 Па
            </li>
            <li>
              Delta_Pw_total (Суммарное гидравлическое сопротивление блока) =
              80.095 кПа
            </li>
          </ul>
        </div>
      </div>
    </>
  );
}

/* Формулы расчета противотока */
function CounterFlowFormulas() {
  return (
    <>
      {/* Инженерная методика: расчёт 4-х рядного блока противотока по методу NTU */}
      <Heading
        lvl={4}
        text="Инженерная методика: расчёт 4-х рядного блока противотока по методу NTU"
        className="text-black"
      />

      <p>
        Метод NTU/КПД позволяет рассчитать общую мощность и конечные
        температурные параметры многорядного блока без применения итерационных
        циклов определения промежуточных характеристик сред. Расчет выполняется
        последовательно: от массовых расходов и конструктивной геометрии
        оборудования к финальным температурным показателям. Ниже приведена
        базовая инженерная схема расчета для 4-х рядных блоков КФБ-12 А3 М и
        КФБ-12 А4 М в режиме последовательного встречного противотока.
      </p>

      <ol className="space-y-4">
        <li>
          <p>
            Шаг 1. Тепловая способность воздушного и водяного потоков (W, Вт/°C)
          </p>
          <p>
            Определяет количество тепловой энергии, необходимое для изменения
            температуры потока среды на 1 °C:
          </p>
          <ul>
            <li>• Воздушный поток: W_возд = (G_air / 3600) * 1006</li>
            <li>• Водяной поток: W_воды = (G_w_transit / 3600) * 4187</li>
          </ul>
          <p>
            Для проведения расчета выбирается наименьшее значение: W_min =
            W_возд. На основании полученных величин вычисляется безразмерное
            отношение потоков: W_o = W_min / W_воды.
          </p>
        </li>

        <li>
          <p>Шаг 2. Тепловой потенциал трубного пучка (NTU_block)</p>
          <p>
            Характеризует безразмерную тепловую способность всей площади
            поверхности нагрева установки относительно массового расхода
            воздуха:
          </p>
          <ul>
            <li>• NTU_block = (K_average * F_общ) / W_min</li>
          </ul>
          <p>
            Где: F_общ — суммарная площадь поверхности теплообмена всех четырех
            калориферов блока, м²; K_average — средний коэффициент теплопередачи
            оборудования, Вт/(м²·°C).
          </p>
        </li>

        <li>
          <p>Шаг 3. Итоговый тепловой КПД установки (E_block)</p>
          <p>
            Для последовательно-противоточной схемы обвязки (встречное движение
            сред) общая эффективность теплообмена неперемешивающихся жидкостей и
            газов вычисляется по интегральной зависимости Кэйса-Босмана:
          </p>
          <ul>
            <li>
              • E_block = (1 – exp (-NTU_block * (1 - W_o))) / (1 - W_o * exp
              (-NTU_block * (1 - W_o)))
            </li>
          </ul>
        </li>

        <li>
          <p>Шаг 4. Расчет финальных паспортных параметров</p>
          <ul>
            <li>
              • Общая тепловая мощность блока: Q = W_min * E_block * (T_вх_воды
              - t_вх_возд)
            </li>
            <li>
              • Температура воздуха на выходе: t_out_air = t_вх_возд + Q /
              W_возд
            </li>
            <li>
              • Температура обратной воды: T_out_w = T_вх_воды - Q / W_воды
            </li>
          </ul>
        </li>
      </ol>
    </>
  );
}

/* Интегральный расчет по методу NTU - 3 */
function NTUIntegralCalculation3() {
  return (
    <>
      {/* КФБ-12 А3 М */}
      <div className="mb-8 space-y-2">
        <div>
          <p>
            РАСЧЕТ ОДИНОЧНОГО КАЛОРИФЕРА (1-Я СТУПЕНЬ НАГРЕВА) КФБ-12 А3 М.
            ПРОТИВОТОЧНАЯ СХЕМА. НАГРЕВ ВОЗДУХА ОТ 10°C ДО 36°C
          </p>

          <ul>
            <li>t_in_air (Входящая температура воздуха) = 10.0 °C</li>
            <li>
              t_out_air (Температура воздуха на выходе из блока) = 36.4 °C
            </li>
            <li>
              G_air (Массовый расход воздуха через установку) = 31250 кг/час
              (при rho = 1.25 кг/м³)
            </li>
            <li>
              v_air (Массовая скорость воздуха во фронтальном сечении) = 6.886
              кг/(м²·с)
            </li>
            <li>
              Q_block_total (Тепловая мощность 1-рядного блока) = 232000 Вт (232
              кВт)
            </li>
            <li>G_w_transit (Расход воды на 1-рядный блок) = 10150 кг/час</li>
            <li>
              W_w_tubes (Скорость движения воды в трубках) = 1.000 м/сек
              (жесткая константа)
            </li>
            <li>
              K_average (Коэффициент теплопередачи калорифера) = 79.414
              Вт/(м²·°C)
            </li>
            <li>
              T_in_w (Температура горячей воды на входе в блок из сети) = 95.0
              °C
            </li>
            <li>
              T_out_w (Температура обратной воды на выходе из блока) = 75.3 °C
            </li>
            <li>
              NTU_block (Число единиц переноса тепла установки из 1-го ряда) =
              0.3573
            </li>
            <li>
              E_block (Тепловой КПД / эффективность 1-рядного противоточного
              блока) = 0.311 (31.1%)
            </li>
            <li>
              Delta_Pa_total (Аэродинамическое сопротивление блока) = 232 Па
            </li>
            <li>
              Delta_Pw_total (Гидравлическое сопротивление блока) = 20.157 кПа
            </li>
          </ul>
        </div>

        <div>
          <p>
            РАСЧЕТ 2-Х РЯДНОГО БЛОКА КФБ-12 А3 М ПО МЕТОДУ NTU/КПД.
            ПРОТИВОТОЧНАЯ СХЕМА. НАГРЕВ ВОЗДУХА ОТ 10°C ДО 52°C
          </p>

          <ul>
            <li>t_in_air (Входящая температура воздуха) = 10.0 °C</li>
            <li>
              t_out_air (Температура воздуха на выходе из блока) = 52.0 °C
            </li>
            <li>
              G_air (Массовый расход воздуха через установку) = 31250 кг/час
              (при rho = 1.25 кг/м³)
            </li>
            <li>
              v_air (Массовая скорость воздуха во фронтальном сечении) = 6.886
              кг/(м²·с)
            </li>
            <li>
              Q_block_total (Общая тепловая мощность 2-рядного блока) = 369000
              Вт (369 кВт)
            </li>
            <li>G_w_transit (Расход воды на 2-рядный блок) = 10150 кг/час</li>
            <li>
              W_w_tubes (Скорость движения воды в трубках) = 1.000 м/сек
              (жесткая константа)
            </li>
            <li>
              K_average (Средний коэффициент теплопередачи калориферов) = 79.414
              Вт/(м²·°C)
            </li>
            <li>
              T_in_w (Температура горячей воды на входе в блок из сети) = 95.0
              °C
            </li>
            <li>
              T_out_w (Температура обратной воды на выходе из блока) = 63.8 °C
            </li>
            <li>
              NTU_block (Общее число единиц переноса тепла установки из 2-х
              рядов) = 0.8681
            </li>
            <li>
              E_block (Общий тепловой КПД / эффективность 2-рядного
              противоточного блока) = 0.494 (49.4%)
            </li>
            <li>
              Delta_Pa_total (Суммарное аэродинамическое сопротивление блока) =
              465 Па
            </li>
            <li>
              Delta_Pw_total (Суммарное гидравлическое сопротивление блока) =
              40.313 кПа
            </li>
          </ul>
        </div>

        <div>
          <p>
            РАСЧЕТ 3-Х РЯДНОГО БЛОКА КФБ-12 А3 М ПО МЕТОДУ NTU/КПД.
            ПРОТИВОТОЧНАЯ СХЕМА. НАГРЕВ ВОЗДУХА ОТ 10°C ДО 62°C
          </p>

          <ul>
            <li>t_in_air (Входящая температура воздуха) = 10.0 °C</li>
            <li>
              t_out_air (Температура воздуха на выходе из блока) = 61.7 °C
            </li>
            <li>
              G_air (Массовый расход воздуха через установку) = 31250 кг/час
              (при rho = 1.25 кг/м³)
            </li>
            <li>
              v_air (Массовая скорость воздуха во фронтальном сечении) = 6.886
              кг/(м²·с)
            </li>
            <li>
              Q_block_total (Общая тепловая мощность 3-рядного блока) = 454000
              Вт (454 кВт)
            </li>
            <li>G_w_transit (Расход воды на 3-рядный блок) = 10150 кг/час</li>
            <li>
              W_w_tubes (Скорость движения воды в трубках) = 1.000 м/сек
              (жесткая константа)
            </li>
            <li>
              K_average (Средний коэффициент теплопередачи калориферов) = 79.414
              Вт/(м²·°C)
            </li>
            <li>
              T_in_w (Температура горячей воды на входе в блок из сети) = 95.0
              °C
            </li>
            <li>
              T_out_w (Температура обратной воды на выходе из блока) = 56.5 °C
            </li>
            <li>
              NTU_block (Общее число единиц переноса тепла установки из 3-х
              рядов) = 1.3021
            </li>
            <li>
              E_block (Общий тепловой КПД / эффективность 3-рядного
              противоточного блока) = 0.608 (60.8%)
            </li>
            <li>
              Delta_Pa_total (Суммарное аэродинамическое сопротивление блока) =
              697 Па
            </li>
            <li>
              Delta_Pw_total (Суммарное гидравлическое сопротивление блока) =
              60.470 кПа
            </li>
          </ul>
        </div>

        <div>
          <p>
            РАСЧЕТ 4-Х РЯДНОГО БЛОКА КФБ-12 А3 М ПО МЕТОДУ NTU/КПД.
            ПРОТИВОТОЧНАЯ СХЕМА. НАГРЕВ ВОЗДУХА ОТ 10°C ДО 68°C
          </p>

          <ul>
            <li>t_in_air (Входящая температура воздуха) = 10.0 °C</li>
            <li>
              t_out_air (Итоговая температура воздуха на выходе из блока) = 68.4
              °C
            </li>
            <li>
              G_air (Массовый расход воздуха через установку) = 31250 кг/час
              (при rho = 1.25 кг/м³)
            </li>
            <li>
              v_air (Массовая скорость воздуха во фронтальном сечении) = 6.886
              кг/(м²·с)
            </li>
            <li>
              Q_block_total (Общая тепловая мощность 4-рядного блока) = 513000
              Вт (513 кВт)
            </li>
            <li>G_w_transit (Расход воды на 4-рядный блок) = 10150 кг/час</li>
            <li>
              W_w_tubes (Скорость движения воды в трубках) = 1.000 м/сек
              (жесткая константа)
            </li>
            <li>
              K_average (Средний коэффициент теплопередачи калориферов) = 79.414
              Вт/(м²·°C)
            </li>
            <li>
              T_in_w (Температура горячей воды на входе в блок из сети) = 95.0
              °C
            </li>
            <li>
              T_out_w (Итоговая температура обратной воды на выходе из блока) =
              51.5 °C
            </li>
            <li>
              NTU_block (Общее число единиц переноса тепла установки из 4-х
              рядов) = 1.7361
            </li>
            <li>
              E_block (Общий тепловой КПД / эффективность 4-рядного
              противоточного блока) = 0.687 (68.7%)
            </li>
            <li>
              Delta_Pa_total (Суммарное аэродинамическое сопротивление блока) =
              929 Па
            </li>
            <li>
              Delta_Pw_total (Суммарное гидравлическое сопротивление блока) =
              80.626 кПа
            </li>
          </ul>
        </div>
      </div>

      <Separator className="mb-8" />

      {/* КФБ-12 А4 М */}
      <div className="space-y-2">
        <div>
          <p>
            РАСЧЕТ ОДИНОЧНОГО КАЛОРИФЕРА (1-Я СТУПЕНЬ НАГРЕВА) КФБ-12 А4 М.
            ПРОТИВОТОЧНАЯ СХЕМА. НАГРЕВ ВОЗДУХА ОТ 10°C ДО 42°C
          </p>

          <ul>
            <li>t_in_air (Входящая температура воздуха) = 10.0 °C</li>
            <li>
              t_out_air (Температура воздуха на выходе из блока) = 42.2 °C
            </li>
            <li>
              G_air (Массовый расход воздуха через установку) = 31250 кг/час
              (при rho = 1.25 кг/м³)
            </li>
            <li>
              v_air (Массовая скорость воздуха во фронтальном сечении) = 6.886
              кг/(м²·с)
            </li>
            <li>
              Q_block_total (Тепловая мощность 1-рядного блока) = 283000 Вт (283
              кВт)
            </li>
            <li>G_w_transit (Расход воды на 1-рядный блок) = 13440 кг/час</li>
            <li>
              W_w_tubes (Скорость движения воды в трубках) = 1.000 м/сек
              (жесткая константа)
            </li>
            <li>
              K_average (Коэффициент теплопередачи калорифера) = 76.342
              Вт/(м²·°C)
            </li>
            <li>
              T_in_w (Температура горячей воды на входе в блок из сети) = 95.0
              °C
            </li>
            <li>
              T_out_w (Температура обратной воды на выходе из блока) = 76.9 °C
            </li>
            <li>
              NTU_block (Число единиц переноса тепла установки из 1-го ряда) =
              0.5731
            </li>
            <li>
              E_block (Тепловой КПД / эффективность 1-рядного противоточного
              блока) = 0.379 (37.9%)
            </li>
            <li>
              Delta_Pa_total (Аэродинамическое сопротивление блока) = 307 Па
            </li>
            <li>
              Delta_Pw_total (Гидравлическое сопротивление блока) = 20.024 кПа
            </li>
          </ul>
        </div>

        <div>
          <p>
            РАСЧЕТ 2-Х РЯДНОГО БЛОКА КФБ-12 А4 М ПО МЕТОДУ NTU/КПД.
            ПРОТИВОТОЧНАЯ СХЕМА. НАГРЕВ ВОЗДУХА ОТ 10°C ДО 60°C
          </p>

          <ul>
            <li>t_in_air (Входящая температура воздуха) = 10.0 °C</li>
            <li>
              t_out_air (Температура воздуха на выходе из блока) = 60.0 °C
            </li>
            <li>
              G_air (Массовый расход воздуха через установку) = 31250 кг/час
              (при rho = 1.25 кг/м³)
            </li>
            <li>
              v_air (Массовая скорость воздуха во фронтальном сечении) = 6.886
              кг/(м²·с)
            </li>
            <li>
              Q_block_total (Общая тепловая мощность 2-рядного блока) = 439000
              Вт (439 кВт)
            </li>
            <li>G_w_transit (Расход воды на 2-рядный блок) = 13440 кг/час</li>
            <li>
              W_w_tubes (Скорость движения воды в трубках) = 1.000 м/сек
              (жесткая константа)
            </li>
            <li>
              K_average (Средний коэффициент теплопередачи калориферов) = 76.342
              Вт/(м²·°C)
            </li>
            <li>
              T_in_w (Температура горячей воды на входе в блок из сети) = 95.0
              °C
            </li>
            <li>
              T_out_w (Температура обратной воды на выходе из блока) = 66.9 °C
            </li>
            <li>
              NTU_block (Общее число единиц переноса тепла установки из 2-х
              рядов) = 1.1069
            </li>
            <li>
              E_block (Общий тепловой КПД / эффективность 2-рядного
              противоточного блока) = 0.588 (58.8%)
            </li>
            <li>
              Delta_Pa_total (Суммарное аэродинамическое сопротивление блока) =
              613 Па
            </li>
            <li>
              Delta_Pw_total (Суммарное гидравлическое сопротивление блока) =
              40.047 кПа
            </li>
          </ul>
        </div>

        <div>
          <p>
            РАСЧЕТ 3-Х РЯДНОГО БЛОКА КФБ-12 А4 М ПО МЕТОДУ NTU/КПД.
            ПРОТИВОТОЧНАЯ СХЕМА. НАГРЕВ ВОЗДУХА ОТ 10°C ДО 70°C
          </p>

          <ul>
            <li>t_in_air (Входящая температура воздуха) = 10.0 °C</li>
            <li>
              t_out_air (Температура воздуха на выходе из блока) = 70.3 °C
            </li>
            <li>
              G_air (Массовый расход воздуха через установку) = 31250 кг/час
              (при rho = 1.25 кг/м³)
            </li>
            <li>
              v_air (Массовая скорость воздуха во фронтальном сечении) = 6.886
              кг/(м²·с)
            </li>
            <li>
              Q_block_total (Общая тепловая мощность 3-рядного блока) = 530000
              Вт (530 кВт)
            </li>
            <li>G_w_transit (Расход воды на 3-рядный блок) = 13440 кг/час</li>
            <li>
              W_w_tubes (Скорость движения воды в трубках) = 1.000 м/сек
              (жесткая константа)
            </li>
            <li>
              K_average (Средний коэффициент теплопередачи калориферов) = 76.342
              Вт/(м²·°C)
            </li>
            <li>
              T_in_w (Температура горячей воды на входе в блок из сети) = 95.0
              °C
            </li>
            <li>
              T_out_w (Температура обратной воды на выходе из блока) = 61.1 °C
            </li>
            <li>
              NTU_block (Общее число единиц переноса тепла установки из 3-х
              рядов) = 1.6599
            </li>
            <li>
              E_block (Общий тепловой КПД / эффективность 3-рядного
              противоточного блока) = 0.710 (71.0%)
            </li>
            <li>
              Delta_Pa_total (Суммарное аэродинамическое сопротивление блока) =
              920 Па
            </li>
            <li>
              Delta_Pw_total (Суммарное гидравлическое сопротивление блока) =
              60.071 кПа
            </li>
          </ul>
        </div>

        <div>
          <p>
            РАСЧЕТ 4-Х РЯДНОГО БЛОКА КФБ-12 А4 М ПО МЕТОДУ NTU/КПД.
            ПРОТИВОТОЧНАЯ СХЕМА. НАГРЕВ ВОЗДУХА ОТ 10°C ДО 77°C
          </p>

          <ul>
            <li>t_in_air (Входящая температура воздуха) = 10.0 °C</li>
            <li>
              t_out_air (Итоговая температура воздуха на выходе из блока) = 77.1
              °C
            </li>
            <li>
              G_air (Массовый расход воздуха через установку) = 31250 кг/час
              (при rho = 1.25 кг/м³)
            </li>
            <li>
              v_air (Массовая скорость воздуха во фронтальном сечении) = 6.886
              кг/(м²·с)
            </li>
            <li>
              Q_block_total (Общая тепловая мощность 4-рядного блока) = 589000
              Вт (589 кВт)
            </li>
            <li>G_w_transit (Расход воды на 4-рядный блок) = 13440 кг/час</li>
            <li>
              W_w_tubes (Скорость движения воды в трубках) = 1.000 м/сек
              (жесткая константа)
            </li>
            <li>
              K_average (Средний коэффициент теплопередачи калориферов) = 76.342
              Вт/(м²·°C)
            </li>
            <li>
              T_in_w (Температура горячей воды на входе в блок из сети) = 95.0
              °C
            </li>
            <li>
              T_out_w (Итоговая температура обратной воды на выходе из блока) =
              57.3 °C
            </li>
            <li>
              NTU_block (Общее число единиц переноса тепла установки из 4-х
              рядов) = 2.2083
            </li>
            <li>
              E_block (Общий тепловой КПД / эффективность 4-рядного
              противоточного блока) = 0.789 (78.9%)
            </li>
            <li>
              Delta_Pa_total (Суммарное аэродинамическое сопротивление блока) =
              1226 Па
            </li>
            <li>
              Delta_Pw_total (Суммарное гидравлическое сопротивление блока) =
              80.095 кПа
            </li>
          </ul>
        </div>
      </div>
    </>
  );
}
