import productData from "@/data/products.json";

import type { Metadata } from "next";

import Heading from "@/components/general_pages/heading";
import ProductParagraph from "@/components/catalog/productParagraph";
import Image from "next/image";
import CategoryCards from "@/components/categoryCards";
import { sortProducts } from "@/lib/utils";

export const metadata: Metadata = {
  title: "Коэффициент теплопередачи паровых калориферов",
  description:
    "Коэффициент теплопередачи паровых калориферов. Расчет коэффициента теплопередачи и аэродинамического сопротивления воздухонагревателей с теплоносителем пар",
  keywords:
    "коэффициент теплопередачи парового калорифера,коэффициент теплопередачи парового воздухонагревателя,коэффициент теплопередачи парового теплообменника,расчет коэффициента теплопередачи парового калорифера,формула коэффициента теплопередачи парового калорифера,аэродинамическое сопротивление парового калорифера,расчет аэродинамического сопротивления парового калорифера,формула аэродинамического сопротивления парового калорифера,коэффициент теплопередачи калориферов кпск,аэродинамическое сопротивление калориферов кпск",
};

const heatTransferElemLength = [
  "0.530",
  "0.655",
  "0.780",
  "0.905",
  "1.155",
  "0.530",
  "0.655",
  "0.780",
  "0.905",
  "1.155",
  "1.655",
  "1.655",
];

const airMovementMassVelocity = [
  "1.5",
  "2.0",
  "2.5",
  "3.0",
  "3.5",
  "4.0",
  "4.5",
  "5.0",
  "5.5",
  "6.0",
  "6.5",
  "7.0",
  "8.0",
];

// prettier-ignore
const tableValues = {
  'kpsk': {
    2: [
      ["41.50", "45.99", "49.80", "53.15", "56.16", "58.90", "61.43", "63.78", "65.99", "68.07", "70.04", "71.92", "75.43"],
      ["40.87", "45.29", "49.04", "52.34", "55.30", "58.00", "60.49", "62.81", "64.98", "67.04", "68.98", "70.83", "74.29"],
      ["40.36", "44.73", "48.44", "51.69", "54.62", "57.28", "59.74", "62.03", "64.18", "66.20", "68.12", "69.95", "73.37"],
      ["39.93", "44.25", "47.92", "51.14", "54.03", "56.67", "59.10", "61.37", "63.49", "65.49", "67.39", "69.20", "72.58"],
      ["39.24", "43.48", "47.08", "50.25", "53.09", "55.68", "58.08", "60.30", "62.39", "64.36", "66.22", "68.00", "71.32"],
      ["41.50", "45.99", "49.80", "53.15", "56.16", "58.90", "61.43", "63.78", "65.99", "68.07", "70.04", "71.92", "75.43"],
      ["40.87", "45.29", "49.04", "52.34", "55.30", "58.00", "60.49", "62.81", "64.98", "67.04", "68.98", "70.83", "74.29"],
      ["40.36", "44.73", "48.44", "51.69", "54.62", "57.28", "59.74", "62.03", "64.18", "66.20", "68.12", "69.95", "73.37"],
      ["39.93", "44.25", "47.92", "51.14", "54.03", "56.67", "59.10", "61.37", "63.49", "65.49", "67.39", "69.20", "72.58"],
      ["39.24", "43.48", "47.08", "50.25", "53.09", "55.68", "58.08", "60.30", "62.39", "64.36", "66.22", "68.00", "71.32"],
      ["38.23", "43.36", "45.88", "48.96", "51.73", "54.25", "56.59", "58.76", "60.79", "62.70", "64.54", "66.25", "69.49"],
      ["38.23", "43.36", "45.88", "48.96", "51.73", "54.25", "56.59", "58.76", "60.79", "62.70", "64.54", "66.25", "69.49"],
      [9, 15, 23, 32, 42, 54, 67, 81, 96, 113, 131, 149, 191]
    ],
    3: [
      ["37.24", "41.84", "45.79", "49.30", "52.48", "55.40", "58.10", "60.63", "63.02", "65.28", "67.43", "69.49", "73.35"],
      ["36.72", "41.26", "45.16", "48.62", "51.75", "54.63", "57.30", "59.79", "62.15", "64.37", "66.50", "68.52", "72.33"],
      ["36.30", "40.78", "44.64", "48.06", "51.16", "54.00", "56.64", "59.11", "61.43", "63.64", "65.73", "67.74", "71.50"],
      ["35.94", "40.39", "44.20", "47.59", "50.66", "53.47", "56.09", "58.53", "60.84", "63.02", "65.09", "67.08", "70.80"],
      ["35.37", "39.74", "43.50", "46.83", "49.85", "52.62", "55.19", "57.59", "59.86", "62.01", "64.05", "66.00", "69.67"],
      ["37.24", "41.84", "45.79", "49.30", "52.48", "55.40", "58.10", "60.63", "63.02", "65.28", "67.43", "69.49", "73.35"],
      ["36.72", "41.26", "45.16", "48.62", "51.75", "54.63", "57.30", "59.79", "62.15", "64.37", "66.50", "68.52", "72.33"],
      ["36.30", "40.78", "44.64", "48.06", "51.16", "54.00", "56.64", "59.11", "61.43", "63.64", "65.73", "67.74", "71.50"],
      ["35.94", "40.39", "44.20", "47.59", "50.66", "53.47", "56.09", "58.53", "60.84", "63.02", "65.09", "67.08", "70.80"],
      ["35.37", "39.74", "43.50", "46.83", "49.85", "52.62", "55.19", "57.59", "59.86", "62.01", "64.05", "66.00", "69.67"],
      ["34.54", "38.80", "42.47", "45.73", "48.67", "51.38", "53.89", "56.24", "58.45", "60.55", "62.55", "64.45", "68.03"],
      ["34.54", "38.80", "42.47", "45.73", "48.67", "51.38", "53.89", "56.24", "58.45", "60.55", "62.55", "64.45", "68.03"],
      [13, 22, 32, 45, 60, 77, 95, 115, 137, 161, 187, 214, 273]
    ],
    4: [
      [32.39, 37.14, 41.30, 45.05, 48.48, 51.66, 54.64, 57.45, 60.11, 62.66, 65.09, 67.42, 71.85],
      [32.14, 36.86, 40.99, 44.70, 48.11, 51.27, 54.22, 57.01, 59.66, 62.18, 64.59, 66.91, 71.30],
      [31.94, 36.63, 40.73, 44.43, 47.81, 50.95, 53.88, 56.65, 59.29, 61.79, 64.19, 66.50, 70.86],
      [31.77, 36.43, 40.51, 44.19, 47.55, 50.67, 53.60, 56.35, 58.97, 61.46, 63.85, 66.14, 70.48],
      [31.49, 36.11, 40.16, 43.80, 47.14, 50.23, 53.13, 55.86, 58.45, 60.92, 63.29, 65.56, 69.86],
      [32.39, 37.14, 41.30, 45.05, 48.48, 51.66, 54.64, 57.45, 60.11, 62.66, 65.09, 67.42, 71.85],
      [32.14, 36.86, 40.99, 44.70, 48.11, 51.27, 54.22, 57.01, 59.66, 62.18, 64.59, 66.91, 71.30],
      [31.94, 36.63, 40.73, 44.43, 47.81, 50.95, 53.88, 56.65, 59.29, 61.79, 64.19, 66.50, 70.86],
      [31.77, 36.43, 40.51, 44.19, 47.55, 50.67, 53.60, 56.35, 58.97, 61.46, 63.85, 66.14, 70.48],
      [31.49, 36.11, 40.16, 43.80, 47.14, 50.23, 53.13, 55.86, 58.45, 60.92, 63.29, 65.56, 69.86],
      [31.09, 35.65, 39.64, 43.24, 46.53, 49.58, 52.44, 55.14, 57.70, 60.14, 62.47, 64.72, 68.96],
      [31.09, 35.65, 39.64, 43.24, 46.53, 49.58, 52.44, 55.14, 57.70, 60.14, 62.47, 64.72, 68.96],
      [18, 31, 46, 65, 86, 110, 136, 165, 196, 230, 267, 306, 390]
    ],
  },
  'kp': {
    3: [
      ["54.2", "61.4", "67.6", "73.1", "78.1", "82.8", "87.1", "91.1", "94.9", "98.6", "102.0", "105.3", "111.6"],
      ["53.4", "60.5", "66.6", "72.0", "76.9", "81.5", "85.8", "89.7", "93.5", "97.1", "100.5", "103.7", "109.9"],
      ["52.7", "59.7", "65.7", "71.1", "76.0", "80.5", "84.7", "88.6", "92.3", "95.9", "99.2", "102.4", "108.5"],
      ["52.2", "59.1", "65.0", "70.3", "75.2", "79.6", "83.8", "87.7", "91.4", "94.8", "98.2", "101.4", "107.4"],
      ["51.3", "58.0", "63.9", "69.1", "73.9", "78.3", "82.3", "86.1", "89.8", "93.2", "96.5", "99.6", "105.5"],
      ["50.0", "56.6", "62.3", "67.4", "72.0", "76.2", "80.2", "83.9", "87.5", "90.8", "94.0", "97.0", "102.8"],
      ["50.0", "56.6", "62.3", "67.4", "72.0", "76.2", "80.2", "83.9", "87.5", "90.8", "94.0", "97.0", "102.8"],
      ["14", "23", "35", "49", "66", "84", "105", "128", "153", "180", "209", "240", "307"]
    ],
    4: [
      ["46.5", "53.0", "58.6", "63.6", "68.2", "72.4", "76.4", "80.1", "83.7", "87.0", "90.2", "93.3", "99.1"],
      ["45.9", "52.3", "57.8", "62.8", "67.3", "71.5", "75.4", "79.1", "82.6", "85.9", "89.0", "92.1", "97.8"],
      ["45.4", "51.7", "57.2", "62.1", "66.6", "70.7", "74.6", "78.2", "81.7", "84.9", "88.1", "91.1", "96.7"],
      ["45.0", "51.2", "56.6", "61.5", "65.9", "70.0", "73.9", "77.5", "80.9", "84.1", "87.2", "90.2", "95.8"],
      ["44.3", "50.4", "55.8", "60.6", "64.9", "69.0", "72.8", "76.3", "79.7", "82.9", "85.9", "88.8", "94.4"],
      ["43.3", "49.3", "54.5", "59.2", "63.5", "67.4", "71.1", "74.6", "77.9", "81.0", "84.0", "86.8", "92.2"],
      ["43.3", "49.3", "54.5", "59.2", "63.5", "67.4", "71.1", "74.6", "77.9", "81.0", "84.0", "86.8", "92.2"],
      ["18", "31", "47", "66", "88", "112", "140", "170", "202", "238", "276", "316", "404"]
    ],
  }
};

const kpsk = productData
  .filter((p) => p.categories.includes("kpsk"))
  .sort((a, b) => sortProducts(a.name, b.name));
const kpsk2 = kpsk.filter((p) => p.rows == 2);
const kpsk3 = kpsk.filter((p) => p.rows == 3);
const kpsk4 = kpsk.filter((p) => p.rows == 4);

const kp = productData
  .filter((p) => p.categories.includes("kp"))
  .sort((a, b) => sortProducts(a.name, b.name));
const kp3 = kp.filter((p) => p.rows == 3);
const kp4 = kp.filter((p) => p.rows == 4);

const rowsAdj = {
  2: "двухрядных",
  3: "трехрядных",
  4: "четырехрядных",
};

function renderTable(products: any[], tableKey: "kpsk" | "kp") {
  if (!products || products.length === 0) return null;
  const { rows, series } = products[0];

  return (
    <table key={`${tableKey}-${series}-${rows}`}>
      <thead>
        <tr>
          <th colSpan={15}>
            КОЭФФИЦИЕНТЫ ТЕПЛОПЕРЕДАЧИ {rowsAdj[rows]} ПАРОВЫХ КАЛОРИФЕРОВ{" "}
            {`${series} ${rows}`}, (Вт/(м2•°С)
          </th>
        </tr>
        <tr>
          <th rowSpan={2}>КАЛОРИФЕРЫ {`${series} ${rows}`}</th>
          <th rowSpan={2}>Длина теплоотдающего элемента (в свету), м</th>
          <th colSpan={13}>
            Массовая скорость движения воздуха во фронтальном сечении{" "}
            {rowsAdj[rows]} калориферов {`${series}-${rows}`}, (Vp)Н, кг/м2с
          </th>
        </tr>
        <tr>
          {airMovementMassVelocity.map((v) => (
            <th key={v}>{v}</th>
          ))}
        </tr>
      </thead>
      <tbody>
        {products.map((p, i) => (
          <tr key={p.shortName + i}>
            <td>{p.shortName}</td>
            <td>{heatTransferElemLength[i]}</td>
            {tableValues[tableKey][rows][i].map((v: any, j: number) => (
              <td key={j}>{String(v)}</td>
            ))}
          </tr>
        ))}
        <tr>
          <td colSpan={2}>АЭРОДИНАМИЧЕСКОЕ СОПРОТИВЛЕНИЕ, ПА</td>
          {tableValues[tableKey][rows][products.length].map(
            (v: any, i: number) => (
              <td key={i}>{String(v)}</td>
            ),
          )}
        </tr>
      </tbody>
    </table>
  );
}

export default function KoefficientTeploperedachiParovyhKaloriferovPage() {
  return (
    <>
      <Heading lvl={1} text="Коэффициент теплопередачи парового калорифера" />

      <section className="space-y-6">
        <Heading
          lvl={2}
          text="Коэффициент теплопередачи калориферов КПСК КП КФБ-А"
        />
        <div className="space-y-1">
          <ProductParagraph>
            Коэффициент теплопередачи паровых калориферов есть показатель
            интенсивности переноса тепловой энергии от греющего теплоносителя,
            водяного пара, нагреваемому теплоносителю, воздуху, через
            разделяющие их стенки трубчатых элементов со спирально-накатным
            оребрением. Значение коэффициента теплопередачи устанавливает, какое
            количество теплоты будет передано за единицу времени через один
            квадратный метр площади поверхности теплообмена паровоздушного
            воздухонагревателя при разности температур между теплоносителями в
            один градус.
          </ProductParagraph>
          <ProductParagraph>
            Процесс теплопередачи в паровом биметаллическом теплообменнике серии
            КПСк, КП, КФБ-А П включает несколько последовательно протекающих
            стадий:
          </ProductParagraph>
          <ul>
            <li>
              - конденсирующийся водяной пар отдает тепловую энергию внутренним
              стенкам несущих стальных трубок;
            </li>
            <li>
              - теплота распространяется по всему сечению трубок и по
              алюминиевой оболочке с винтовыми накатными ребрами за счет
              теплопроводности;
            </li>
            <li>
              - нагретая оребренная поверхность передает тепло более холодному
              воздуху конвективным путем.
            </li>
          </ul>
        </div>
        <div className="flex w-full flex-col gap-3 sm:flex-row sm:gap-0">
          <div className="relative aspect-1000/650 w-full">
            <Image
              src="/img/general_pages/kalorifer_par_teploperedacha.png"
              alt="Расчет коэффициента теплопередачи паровых теплообменников"
              title="Паровой калорифер коэффициент теплопередачи"
              fill
            />
          </div>
          <div className="relative aspect-1000/650 w-full">
            <Image
              src="/img/general_pages/kalorifer_par_soprotivlenie.png"
              alt="Аэродинамическое сопротивление калориферов КПСк2 КПСк3 КПСк4"
              title="Аэродинамическое сопротивление паровых калориферов"
              fill
            />
          </div>
        </div>
      </section>

      <div className="flex w-full flex-col gap-3 sm:flex-row sm:gap-0">
        <div className="relative aspect-1000/650 w-full">
          <Image
            src="/img/general_pages/par_kalorifer_teploperedacha.png"
            alt="Коэффициент теплопередачи калориферов КПСк"
            title="Паровой калорифер с гладкими и оребренными трубками"
            fill
          />
        </div>
        <div className="relative aspect-1000/650 w-full">
          <Image
            src="/img/general_pages/par_kalorifer_soprotivlenie.png"
            alt="Формула для расчета теплоотдачи и сопротивления паровых калориферов"
            title="Паровые воздухонагреватели расчет теплопередачи"
            fill
          />
        </div>
      </div>
    </>
  );
}
